/* eslint-disable react/no-unescaped-entities */

import { getELangKey } from '@/lib/utils/getLanguage';
import { ESegment, MAIN_URL, TParams } from '@/models/url.model';
import { Title } from '@/components/custom/Title';
import { ELanguage } from '@/models/language.model';
import { DEFAULT_META_OG, SITE_DOMAIN } from '@/models/root.model';
import SeoLink from '@/components/custom/SeoLink';
import { Metadata } from 'next';
import {
  IS_SITE_ADDRESS_SHOWED,
  META_TERMS,
  siteAddress,
} from '@/models/policy.model';
import { SiteAddress } from '@/components/custom/SiteAddress';

export const revalidate = 2592000; // 3600 * 24 * 30 invalidate cache every month

export const dynamicParams = false;

const { EN, UA } = ELanguage;

const baseUrl = process.env.NEXT_PUBLIC_BASE_URL || MAIN_URL;
const siteMail = process.env.NEXT_PUBLIC_SITE_EMAIL || 'mail@ezoteric.net';
const siteLegalName = DEFAULT_META_OG.siteName;

const lastUpdatedDate = { [EN]: 'April 17, 2025', [UA]: '17 квітня 2025' };

export const generateMetadata = async ({
  params,
}: {
  params: TParams;
}): Promise<Metadata> => {
  const p = await params;
  const lang = getELangKey(p.lang);

  return {
    metadataBase: new URL(baseUrl),
    ...META_TERMS[lang],
    openGraph: {
      ...DEFAULT_META_OG,
      ...META_TERMS[lang],
      url: `/${lang}/${ESegment.TERMS_AND_CONDITIONS}`,
    },
    alternates: {
      canonical: `/${lang}/${ESegment.TERMS_AND_CONDITIONS}`,
      languages: {
        en: `/${EN}/${ESegment.TERMS_AND_CONDITIONS}`,
        uk: `/${UA}/${ESegment.TERMS_AND_CONDITIONS}`,
      },
    },
  };
};

export default async function Page({ params }: { params: TParams }) {
  const p = await params;
  const lang = getELangKey(p.lang);

  const privacyPolicyUrl = `${baseUrl}/${lang}/${ESegment.PRIVACY_POLICY}`;

  return (
    <article className="relative mx-auto bg-tertiary rounded-2xl py-8 px-12">
      {lang === UA ? (
        <>
          <Title>ПРАВИЛА ТА УМОВИ</Title>
          <p className="text-sm text-muted-foreground mb-6">
            Останнє оновлення: {lastUpdatedDate[lang]}
          </p>

          <h2 className="text-xl font-semibold my-4">
            УГОДА ЩОДО НАШИХ ЮРИДИЧНИХ УМОВ
          </h2>
          <p className="mb-4">
            Ми - {siteLegalName} ("<strong>Компанія</strong>", "
            <strong>ми</strong>", "<strong>нас</strong>", "<strong>наш</strong>
            ")
            {IS_SITE_ADDRESS_SHOWED &&
              `, компанія, зареєстрована в Україні за адресою:`}
          </p>
          {IS_SITE_ADDRESS_SHOWED && (
            <SiteAddress
              siteLegalName={siteLegalName}
              siteAddress={siteAddress[lang]}
            />
          )}

          <p className="mb-4">
            Ми керуємо веб-сайтом{' '}
            <SeoLink
              href={baseUrl}
              title={`Відвідати ${SITE_DOMAIN}`}
              isTargetBlank
              className="text-blue-500 hover:underline"
            >
              {baseUrl}
            </SeoLink>{' '}
            (далі – "<strong>Сайт</strong>"), а також будь-якими іншими
            пов'язаними продуктами та послугами, які посилаються або пов'язані з
            цими юридичними умовами (далі – "<strong>Юридичні умови</strong>")
            (разом – "<strong>Послуги</strong>").
          </p>
          <p className="mb-4">
            Онлайн-платформа, присвячена езотеричним знанням та самопізнанню
            через такі дисципліни, як Дизайн Людини, нумерологія, Таро,
            Астрологія, Сакральна Геометрія та Фен-Шуй. Сайт пропонує
            інструменти, такі як нумерологічний калькулятор, інформативні статті
            в блозі, тести, ШІ-чат-бот для отримання відповідей, а також планує
            надання платних консультаційних сеансів з експертами.
          </p>
          <p className="mb-4">
            Ви можете зв'язатися з нами за електронною поштою{' '}
            <SeoLink
              href={`mailto:${siteMail}`}
              className="text-blue-500 hover:underline"
              title={`Написати листа на ${siteMail}`}
            >
              {siteMail}
            </SeoLink>
          </p>
          <p className="mb-4">
            Ці Юридичні умови становлять юридично зобов'язуючу угоду, укладену
            між вами, особисто або від імені юридичної особи ("
            <strong>ви</strong>"), та {siteLegalName || 'нами'}, стосовно вашого
            доступу до Послуг та їх використання. Ви погоджуєтесь, що, отримуючи
            доступ до Послуг, ви прочитали, зрозуміли та погодились
            дотримуватися всіх цих Юридичних умов. **ЯКЩО ВИ НЕ ПОГОДЖУЄТЕСЬ З
            УСІМА ЦИМИ ЮРИДИЧНИМИ УМОВАМИ, ТО ВАМ ЯВНО ЗАБОРОНЕНО
            ВИКОРИСТОВУВАТИ ПОСЛУГИ, І ВИ ПОВИННІ НЕГАЙНО ПРИПИНИТИ ЇХ
            ВИКОРИСТАННЯ.**
          </p>
          <p className="mb-4">
            Ми будемо публікувати будь-які оновлення цих юридичних умов на
            відповідних сторінках нашого веб-сайту та оновимо дату «Останнього
            оновлення». Щодо суттєвих змін, ми можемо додатково надати
            сповіщення через інтерфейс веб-сайту або, для зареєстрованих
            користувачів, за допомогою повідомлення електронною поштою на
            адресу, пов'язану з їхнім обліковим записом.
          </p>
          <p className="mb-4">
            Послуги призначені для користувачів, яким виповнилося щонайменше 18
            років. Особам віком до 18 років не дозволяється використовувати
            Послуги або реєструватися на них.
          </p>
          <p className="mb-6">
            Ми рекомендуємо вам роздрукувати копію цих Юридичних умов для вашого
            обліку.
          </p>

          <h2 className="text-xl font-semibold my-4">ЗМІСТ</h2>
          <ul className="list-decimal list-inside space-y-1 mb-6">
            <li>
              <a href="#services" className="text-blue-500 hover:underline">
                НАШІ ПОСЛУГИ
              </a>
            </li>
            <li>
              <a href="#ip" className="text-blue-500 hover:underline">
                ПРАВА ІНТЕЛЕКТУАЛЬНОЇ ВЛАСНОСТІ
              </a>
            </li>
            <li>
              <a href="#userrep" className="text-blue-500 hover:underline">
                ЗАЯВЛЕННЯ КОРИСТУВАЧА
              </a>
            </li>
            <li>
              <a href="#userreg" className="text-blue-500 hover:underline">
                РЕЄСТРАЦІЯ КОРИСТУВАЧА
              </a>
            </li>
            <li>
              <a href="#purchase" className="text-blue-500 hover:underline">
                ПОКУПКИ ТА ОПЛАТА
              </a>
            </li>
            <li>
              <a href="#policy" className="text-blue-500 hover:underline">
                ПОЛІТИКА ПОВЕРНЕННЯ
              </a>
            </li>
            <li>
              <a href="#prohibited" className="text-blue-500 hover:underline">
                ЗАБОРОНЕНІ ДІЇ
              </a>
            </li>
            <li>
              <a href="#ugc" className="text-blue-500 hover:underline">
                КОНТЕНТ, СТВОРЕНИЙ КОРИСТУВАЧАМИ
              </a>
            </li>
            <li>
              <a href="#license" className="text-blue-500 hover:underline">
                ЛІЦЕНЗІЯ НА ВНЕСКИ
              </a>
            </li>
            <li>
              <a href="#social" className="text-blue-500 hover:underline">
                СОЦІАЛЬНІ МЕРЕЖІ
              </a>
            </li>
            <li>
              <a href="#thirdparty" className="text-blue-500 hover:underline">
                ВЕБ-САЙТИ ТА КОНТЕНТ ТРЕТІХ СТОРІН
              </a>
            </li>
            <li>
              <a href="#advertisers" className="text-blue-500 hover:underline">
                РЕКЛАМОДАВЦІ
              </a>
            </li>
            <li>
              <a href="#management" className="text-blue-500 hover:underline">
                УПРАВЛІННЯ ПОСЛУГАМИ
              </a>
            </li>
            <li>
              <a href="#privacy" className="text-blue-500 hover:underline">
                ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
              </a>
            </li>
            <li>
              <a href="#terms" className="text-blue-500 hover:underline">
                ТЕРМІН ДІЇ ТА ПРИПИНЕННЯ
              </a>
            </li>
            <li>
              <a
                href="#modifications"
                className="text-blue-500 hover:underline"
              >
                ЗМІНИ ТА ПЕРЕРВИ
              </a>
            </li>
            <li>
              <a href="#law" className="text-blue-500 hover:underline">
                РЕГУЛЮЮЧЕ ЗАКОНОДАВСТВО
              </a>
            </li>
            <li>
              <a href="#disputes" className="text-blue-500 hover:underline">
                ВИРІШЕННЯ СПОРІВ
              </a>
            </li>
            <li>
              <a href="#corrections" className="text-blue-500 hover:underline">
                ВИПРАВЛЕННЯ
              </a>
            </li>
            <li>
              <a href="#disclaimer" className="text-blue-500 hover:underline">
                ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ
              </a>
            </li>
            <li>
              <a href="#liability" className="text-blue-500 hover:underline">
                ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ
              </a>
            </li>
            <li>
              <a
                href="#indemnification"
                className="text-blue-500 hover:underline"
              >
                ВІДШКОДУВАННЯ ЗБИТКІВ
              </a>
            </li>
            <li>
              <a href="#userdata" className="text-blue-500 hover:underline">
                ДАНІ КОРИСТУВАЧА
              </a>
            </li>
            <li>
              <a href="#electronic" className="text-blue-500 hover:underline">
                ЕЛЕКТРОННІ КОМУНІКАЦІЇ, ТРАНЗАКЦІЇ ТА ПІДПИСИ
              </a>
            </li>
            <li>
              <a href="#california" className="text-blue-500 hover:underline">
                КОРИСТУВАЧІ ТА ЖИТЕЛІ КАЛІФОРНІЇ
              </a>
            </li>
            <li>
              <a href="#misc" className="text-blue-500 hover:underline">
                РІЗНЕ
              </a>
            </li>
            <li>
              <a href="#contact" className="text-blue-500 hover:underline">
                ЗВ'ЯЖІТЬСЯ З НАМИ
              </a>
            </li>
          </ul>

          {/* --- Далі йдуть адаптовані секції з Termly та прикладу --- */}

          <section id="services">
            <h2 className="text-2xl font-semibold my-4">1. НАШІ ПОСЛУГИ</h2>
            <p className="mb-4">
              Інформація, що надається під час використання Послуг, не
              призначена для розповсюдження або використання будь-якою фізичною
              чи юридичною особою в будь-якій юрисдикції або країні, де таке
              розповсюдження або використання суперечило б закону чи
              нормативному акту, або яке підлягало б будь-якій вимозі щодо
              реєстрації в такій юрисдикції чи країні. Відповідно, ті особи, які
              вирішують отримати доступ до Послуг з інших місць, роблять це за
              власною ініціативою та несуть виключну відповідальність за
              дотримання місцевих законів, якщо і в тій мірі, в якій застосовні
              місцеві закони.
            </p>
            <p className="mb-4">
              Послуги не адаптовані для дотримання галузевих норм (наприклад,
              Закон про перенесення та підзвітність медичного страхування
              (HIPAA), Федеральний закон про управління інформаційною безпекою
              (FISMA) тощо), тому, якщо ваші взаємодії підпадатимуть під дію
              таких законів, ви не можете використовувати Послуги. Ви не можете
              використовувати Послуги таким чином, що порушує Закон
              Гремма-Ліча-Блайлі (GLBA).
            </p>
          </section>

          <section id="ip">
            <h2 className="text-2xl font-semibold my-4">
              2. ПРАВА ІНТЕЛЕКТУАЛЬНОЇ ВЛАСНОСТІ
            </h2>
            <h3 className="text-xl font-semibold my-2">
              Наша інтелектуальна власність
            </h3>
            <p className="mb-4">
              Ми є власником або ліцензіатом усіх прав інтелектуальної власності
              на наші Послуги, включаючи весь вихідний код, бази даних,
              функціональність, програмне забезпечення, дизайн веб-сайтів,
              аудіо, відео, текст, фотографії та графіку в Послугах (разом – "
              <strong>Контент</strong>"), а також торговельні марки, знаки для
              послуг та логотипи, що містяться в них ("
              <strong>Знаки</strong>").
            </p>
            <p className="mb-4">
              Наш Контент та Знаки захищені законами про авторське право та
              торговельні марки (а також різними іншими правами інтелектуальної
              власності та законами про недобросовісну конкуренцію) та
              договорами в Україні та по всьому світу.
            </p>
            <p className="mb-4">
              Контент та Знаки надаються в Послугах "ЯК Є" виключно для вашого
              особистого, некомерційного використання.
            </p>
            <h3 className="text-xl font-semibold my-2">
              Ваше використання наших Послуг
            </h3>
            <p className="mb-4">
              За умови дотримання вами цих Юридичних умов, включаючи розділ "
              <a href="#prohibited" className="text-blue-500 hover:underline">
                ЗАБОРОНЕНІ ДІЇ
              </a>
              " нижче, ми надаємо вам невиключну, непередавану, відкличну
              ліцензію на:
            </p>
            <ul className="list-disc list-inside mb-4 pl-8">
              <li>отримання доступу до Послуг; та</li>
              <li>
                завантаження або друк копії будь-якої частини Контенту, до якої
                ви належним чином отримали доступ,
              </li>
            </ul>
            <p className="mb-4">
              виключно для вашого особистого, некомерційного використання.
            </p>
            <p className="mb-4">
              За винятком випадків, зазначених у цьому розділі або в іншому
              місці наших Юридичних умов, жодна частина Послуг та жоден Контент
              або Знаки не можуть бути скопійовані, відтворені, зведені,
              перевидані, завантажені, опубліковані, публічно показані,
              закодовані, перекладені, передані, розповсюджені, продані,
              ліцензовані або іншим чином використані для будь-яких комерційних
              цілей без нашого явного попереднього письмового дозволу.
            </p>
            <p className="mb-4">
              Якщо ви бажаєте використовувати Послуги, Контент або Знаки
              будь-яким іншим чином, ніж зазначено в цьому розділі або в іншому
              місці наших Юридичних умов, будь ласка, зверніться з запитом до:{' '}
              <SeoLink
                href={`mailto:${siteMail}`}
                className="text-blue-500 hover:underline"
                title={`Написати листа на ${siteMail}`}
              >
                {siteMail}
              </SeoLink>
              . Якщо ми коли-небудь надамо вам дозвіл на публікацію, відтворення
              або публічний показ будь-якої частини наших Послуг або Контенту,
              ви повинні вказати нас як власників або ліцензіарів Послуг,
              Контенту або Знаків та забезпечити показ або видимість будь-якого
              повідомлення про авторське право чи право власності під час
              публікації, відтворення або показу нашого Контенту.
            </p>
            <p className="mb-4">
              Ми залишаємо за собою всі права, не надані вам явно щодо Послуг,
              Контенту та Знаків.
            </p>
            <p className="mb-6">
              Будь-яке порушення цих Прав інтелектуальної власності буде
              вважатися суттєвим порушенням наших Юридичних умов, і ваше право
              на використання наших Послуг буде негайно припинено.
            </p>
          </section>

          <section id="userrep">
            <h2 className="text-2xl font-semibold my-4">
              3. ЗАЯВЛЕННЯ КОРИСТУВАЧА
            </h2>
            <p className="mb-4">
              Використовуючи Послуги, ви заявляєте та гарантуєте, що: (1) вся
              реєстраційна інформація, яку ви подаєте, буде правдивою, точною,
              актуальною та повною; (2) ви будете підтримувати точність такої
              інформації та своєчасно оновлювати таку реєстраційну інформацію за
              необхідності; (3) ви маєте дієздатність та погоджуєтесь
              дотримуватися цих Юридичних умов; (4) вам виповнилося 18 років;
              (5) ви не будете отримувати доступ до Послуг автоматизованими або
              нелюдськими засобами, будь то через бота, скрипт чи іншим чином;
              (6) ви не будете використовувати Послуги для будь-яких незаконних
              або несанкціонованих цілей; та (7) ваше використання Послуг не
              порушуватиме жодного чинного закону чи нормативного акту.
            </p>
            <p className="mb-6">
              Якщо ви надаєте будь-яку інформацію, яка є неправдивою, неточною,
              неактуальною або неповною, ми маємо право призупинити або
              припинити дію вашого облікового запису та відмовити у будь-якому
              поточному або майбутньому використанні Послуг (або будь-якої їх
              частини).
            </p>
          </section>

          <section id="userreg">
            <h2 className="text-2xl font-semibold my-4">
              4. РЕЄСТРАЦІЯ КОРИСТУВАЧА
            </h2>
            <p className="mb-4">
              Вам може знадобитися зареєструватися для використання Послуг
              (зокрема, для доступу до платних сеансів). Ви погоджуєтесь
              зберігати конфіденційність вашого пароля та несете
              відповідальність за все використання вашого облікового запису та
              пароля.
            </p>
            <p className="mb-6">
              Ми залишаємо за собою право видалити, повернути або змінити
              вибране вами ім'я користувача, якщо ми на наш власний розсуд
              визначимо, що таке ім'я користувача є недоречним, непристойним або
              іншим чином заперечним.
            </p>
          </section>

          <section id="purchase">
            <h2 className="text-2xl font-semibold my-4">
              5. ПОКУПКИ ТА ОПЛАТА
            </h2>
            <p className="mb-4">Ми приймаємо наступні форми оплати:</p>
            <ul className="list-disc list-inside mb-4 pl-8">
              <li>Visa</li>
              <li>Mastercard</li>
              <li>American Express</li>
              {/* Додайте інші, якщо плануєте підтримувати через Stripe */}
            </ul>
            <p className="mb-4">
              Ви погоджуєтесь надавати актуальну, повну та точну інформацію про
              покупки та обліковий запис для всіх покупок, зроблених через
              Послуги. Ви також погоджуєтесь своєчасно оновлювати інформацію про
              обліковий запис та платіжну інформацію, включаючи адресу
              електронної пошти, спосіб оплати та термін дії платіжної картки,
              щоб ми могли завершити ваші транзакції та зв'язатися з вами за
              необхідності. Податок з продажу (ПДВ) буде додано до ціни покупок,
              якщо це вимагається законом. Ми можемо змінювати ціни в будь-який
              час. Усі платежі здійснюються в Євро (EUR).
            </p>
            <p className="mb-4">
              Ви погоджуєтесь сплачувати всі збори за цінами, що діють на момент
              здійснення ваших покупок, а також будь-які застосовні збори за
              доставку, і ви уповноважуєте нас стягувати обраний вами платіжний
              провайдер за будь-які такі суми при розміщенні вашого замовлення.
              Ми залишаємо за собою право виправляти будь-які помилки або
              помилки в ціноутворенні, навіть якщо ми вже запросили або отримали
              платіж.
            </p>
            {/* Специфікація для токенів */}
            <p className="mb-4">
              Для доступу до певних Послуг, таких як платні сеанси Таро, вам
              необхідно поповнити баланс внутрішніх кредитів (далі – "
              <strong>Токени</strong>") на вашому обліковому записі. Поповнення
              балансу Токенів здійснюється шляхом покупки пакетів Токенів за
              цінами, вказаними на Сайті, за допомогою доступних способів оплати
              через платіжну систему Stripe. Вартість Токенів становить 1 Євро
              за 100 Токенів (або інша вартість, якщо буде змінено). При першій
              реєстрації/авторизації на ваш баланс може бути нараховано 300
              бонусних Токенів. Токени списуються з вашого балансу під час
              використання відповідних платних Послуг відповідно до тарифів,
              вказаних на Сайті (наприклад, 500 Токенів за 5 хвилин сеансу).
            </p>
            <p className="mb-6">
              Ми залишаємо за собою право відмовити в будь-якому замовленні,
              розміщеному через Послуги. Ми можемо, на наш власний розсуд,
              обмежити або скасувати кількість придбаних товарів на особу, на
              домогосподарство або на замовлення. Ці обмеження можуть включати
              замовлення, розміщені одним і тим же обліковим записом клієнта,
              одним і тим же способом оплати, та/або замовлення, що
              використовують одну й ту ж адресу виставлення рахунку або
              доставки. Ми залишаємо за собою право обмежувати або забороняти
              замовлення, які, на нашу єдину думку, схоже, розміщені дилерами,
              посередниками або дистриб'юторами.
            </p>
          </section>

          <section id="policy">
            <h2 className="text-2xl font-semibold my-4">
              6. ПОЛІТИКА ПОВЕРНЕННЯ
            </h2>
            <p className="mb-6">
              Усі продажі є остаточними, і відшкодування не здійснюється. Це
              стосується як покупки Токенів, так і Токенів, використаних для
              оплати Послуг.
            </p>
          </section>

          <section id="prohibited">
            <h2 className="text-2xl font-semibold my-4">7. ЗАБОРОНЕНІ ДІЇ</h2>
            <p className="mb-4">
              Ви не можете отримувати доступ або використовувати Послуги для
              будь-яких цілей, крім тих, для яких ми робимо Послуги доступними.
              Послуги не можуть використовуватися у зв'язку з будь-якими
              комерційними зусиллями, за винятком тих, які спеціально схвалені
              нами.
            </p>
            <p className="mb-4">Як користувач Послуг, ви погоджуєтесь не:</p>
            <ul className="list-disc list-inside mb-6 pl-8">
              <li>
                Систематично витягувати дані або інший контент з Послуг для
                створення або компіляції, прямо чи опосередковано, колекції,
                компіляції, бази даних або каталогу без письмового дозволу від
                нас.
              </li>
              <li>
                Обманювати, шахраювати або вводити в оману нас та інших
                користувачів, особливо в будь-яких спробах дізнатися
                конфіденційну інформацію облікового запису, таку як паролі
                користувачів.
              </li>
              <li>
                Обходити, вимикати або іншим чином втручатися в функції Послуг,
                пов'язані з безпекою, включаючи функції, які запобігають або
                обмежують використання або копіювання будь-якого Контенту, або
                застосовують обмеження на використання Послуг та/або Контенту,
                що міститься в них.
              </li>
              <li>
                Паплюжити, ганьбити або іншим чином шкодити, на нашу думку, нам
                та/або Послугам.
              </li>
              <li>
                Використовувати будь-яку інформацію, отриману з Послуг, для
                переслідування, зловживання або завдання шкоди іншій особі.
              </li>
              <li>
                Неналежним чином використовувати наші служби підтримки або
                подавати неправдиві звіти про зловживання або неправомірну
                поведінку.
              </li>
              <li>
                Використовувати Послуги способом, що не відповідає будь-яким
                чинним законам чи нормативним актам.
              </li>
              <li>
                Брати участь у несанкціонованому фреймінгу або посиланні на
                Послуги.
              </li>
              <li>
                Завантажувати або передавати (або намагатися завантажити або
                передати) віруси, трояни або інший матеріал, включаючи надмірне
                використання великих літер та спам (безперервне розміщення
                повторюваного тексту), що заважає безперебійному використанню та
                насолоді Послугами будь-якою стороною або змінює, погіршує,
                порушує, змінює або втручається у використання, функції,
                можливості, роботу або обслуговування Послуг.
              </li>
              <li>
                Брати участь у будь-якому автоматизованому використанні системи,
                такому як використання скриптів для надсилання коментарів або
                повідомлень, або використання будь-яких інструментів для збору
                даних, роботів або подібних інструментів для збору та вилучення
                даних.
              </li>
              <li>
                Видаляти повідомлення про авторське право або інші права
                власності з будь-якого Контенту.
              </li>
              <li>
                Намагатися видати себе за іншого користувача або особу або
                використовувати ім'я користувача іншого користувача.
              </li>
              <li>
                Завантажувати або передавати (або намагатися завантажити або
                передати) будь-який матеріал, який діє як пасивний або активний
                механізм збору або передачі інформації, включаючи, без обмежень,
                прозорі формати обміну графікою ("gifs"), пікселі 1x1,
                веб-жучки, файли cookie або інші подібні пристрої (іноді звані
                "шпигунським програмним забезпеченням" або "пасивними
                механізмами збору" або "pcms").
              </li>
              <li>
                Втручатися, порушувати або створювати надмірне навантаження на
                Послуги або мережі чи служби, підключені до Послуг.
              </li>
              <li>
                Переслідувати, дратувати, залякувати або погрожувати будь-кому з
                наших співробітників або агентів, залучених до надання вам
                будь-якої частини Послуг.
              </li>
              <li>
                Намагатися обійти будь-які заходи Послуг, призначені для
                запобігання або обмеження доступу до Послуг або будь-якої їх
                частини.
              </li>
              <li>
                Копіювати або адаптувати програмне забезпечення Послуг,
                включаючи, але не обмежуючись, Flash, PHP, HTML, JavaScript або
                інший код.
              </li>
              <li>
                За винятком випадків, дозволених чинним законодавством,
                розшифровувати, декомпілювати, дизасемблювати або здійснювати
                зворотне проектування будь-якого програмного забезпечення, що
                становить або будь-яким чином є частиною Послуг.
              </li>
              <li>
                За винятком випадків, що можуть бути результатом стандартного
                використання пошукової системи або Інтернет-браузера,
                використовувати, запускати, розробляти або поширювати будь-яку
                автоматизовану систему, включаючи, без обмежень, будь-якого
                павука, робота, утиліту для обману, скрейпер або офлайн-читач,
                який отримує доступ до Послуг, або використовувати чи запускати
                будь-який несанкціонований скрипт чи інше програмне
                забезпечення.
              </li>
              <li>
                Використовувати агента з покупок або купівельного агента для
                здійснення покупок на Послугах.
              </li>
              <li>
                Здійснювати будь-яке несанкціоноване використання Послуг,
                включаючи збір імен користувачів та/або адрес електронної пошти
                користувачів електронними або іншими засобами з метою надсилання
                небажаної електронної пошти, або створення облікових записів
                користувачів автоматизованими засобами або під хибними
                приводами.
              </li>
              <li>
                Використовувати Послуги як частину будь-яких зусиль для
                конкуренції з нами або іншим чином використовувати Послуги
                та/або Контент для будь-яких прибуткових починань або
                комерційних підприємств.
              </li>
              <li>Продавати або іншим чином передавати свій профіль.</li>
            </ul>
          </section>

          {/* Секції 8 (UGC) та 9 (Contribution License) додаються, якщо ваш сайт дозволяє користувачам генерувати контент (наприклад, коментарі, відгуки). Якщо ні - їх можна видалити або залишити стандартні формулювання Termly. */}
          <section id="ugc">
            <h2 className="text-2xl font-semibold my-4">
              8. КОНТЕНТ, СТВОРЕНИЙ КОРИСТУВАЧАМИ
            </h2>
            <p className="mb-4">
              Послуги не пропонують користувачам надсилати або публікувати
              контент. Ми не надаємо вам можливості створювати, надсилати,
              публікувати, відображати, передавати, виконувати, публікувати,
              розповсюджувати або транслювати контент та матеріали нам або на
              Послугах, включаючи, але не обмежуючись, текст, письмові
              матеріали, відео, аудіо, фотографії, графіку, коментарі,
              пропозиції або особисту інформацію чи інший матеріал (разом –
              "Внески"). Внески можуть бути видимими для інших користувачів
              Послуг та через сторонні веб-сайти. Таким чином, будь-які Внески,
              які ви передаєте, можуть розглядатися відповідно до Політики
              конфіденційності Послуг. Коли ви створюєте або робите доступними
              будь-які Внески, ви тим самим заявляєте та гарантуєте, що:
            </p>
            {/* ... (Додайте решту підпунктів з Termly, якщо функціонал UGC буде) ... */}
            <p className="mb-6">
              Будь-яке використання Послуг з порушенням вищезазначеного порушує
              ці Юридичні умови та може призвести, серед іншого, до припинення
              або призупинення ваших прав на використання Послуг.
            </p>
          </section>

          <section id="license">
            <h2 className="text-2xl font-semibold my-4">
              9. ЛІЦЕНЗІЯ НА ВНЕСКИ
            </h2>
            <p className="mb-6">
              Ви та Послуги погоджуєтесь, що ми можемо отримувати доступ,
              зберігати, обробляти та використовувати будь-яку інформацію та
              особисті дані, які ви надаєте відповідно до умов Політики
              конфіденційності та вашого вибору (включаючи налаштування).
              Надсилаючи пропозиції або інші відгуки щодо Послуг, ви
              погоджуєтесь, що ми можемо використовувати та ділитися такими
              відгуками для будь-яких цілей без компенсації вам. Ми не заявляємо
              жодних прав власності на ваші Внески. Ви зберігаєте повне право
              власності на всі свої Внески та будь-які права інтелектуальної
              власності або інші майнові права, пов'язані з вашими Внесками. Ми
              не несемо відповідальності за будь-які заяви чи твердження у ваших
              Внесках, наданих вами в будь-якій області на Послугах. Ви несете
              повну відповідальність за свої Внески до Послуг, і ви явно
              погоджуєтесь звільнити нас від будь-якої відповідальності та
              утриматися від будь-яких судових позовів проти нас щодо ваших
              Внесків.
            </p>
          </section>

          <section id="social">
            <h2 className="text-2xl font-semibold my-4">
              10. СОЦІАЛЬНІ МЕРЕЖІ
            </h2>
            <p className="mb-6">
              Як частина функціональності Послуг, ви можете пов'язати свій
              обліковий запис з онлайн-акаунтами, які ви маєте у сторонніх
              постачальників послуг (кожен такий обліковий запис – "Обліковий
              запис третьої сторони"), шляхом: (1) надання інформації для входу
              до вашого Облікового запису третьої сторони через Послуги; або (2)
              дозволу нам отримати доступ до вашого Облікового запису третьої
              сторони, як це дозволено відповідними умовами та положеннями, що
              регулюють використання вами кожного Облікового запису третьої
              сторони. Ви заявляєте та гарантуєте, що маєте право розкривати нам
              інформацію для входу до вашого Облікового запису третьої сторони
              та/або надавати нам доступ до вашого Облікового запису третьої
              сторони, не порушуючи жодних умов та положень, що регулюють
              використання вами відповідного Облікового запису третьої сторони,
              і не зобов'язуючи нас сплачувати будь-які збори або підлягати
              будь-яким обмеженням використання, накладеним стороннім
              постачальником послуг Облікового запису третьої сторони. Надаючи
              нам доступ до будь-яких Облікових записів третіх сторін, ви
              розумієте, що (1) ми можемо отримувати доступ, робити доступним та
              зберігати (якщо застосовно) будь-який контент, який ви надали та
              зберегли у вашому Обліковому записі третьої сторони ("Контент
              соціальної мережі"), щоб він був доступний на Послугах та через
              них через ваш обліковий запис, включаючи, без обмежень, будь-які
              списки друзів, та (2) ми можемо надсилати та отримувати з вашого
              Облікового запису третьої сторони додаткову інформацію в тій мірі,
              в якій вас повідомляють, коли ви пов'язуєте свій обліковий запис з
              Обліковим записом третьої сторони. Залежно від обраних вами
              Облікових записів третіх сторін та згідно з налаштуваннями
              конфіденційності, які ви встановили в таких Облікових записах
              третіх сторін, особиста ідентифікаційна інформація, яку ви
              публікуєте у своїх Облікових записах третіх сторін, може бути
              доступною на вашому обліковому записі на Послугах та через нього.
              Зверніть увагу, що якщо Обліковий запис третьої сторони або
              пов'язана служба стає недоступною або наш доступ до такого
              Облікового запису третьої сторони припиняється стороннім
              постачальником послуг, Контент соціальної мережі може стати
              недоступним на Послугах та через них. Ви матимете можливість
              відключити зв'язок між вашим обліковим записом на Послугах та
              вашими Обліковими записами третіх сторін у будь-який час.
              **ЗВЕРНІТЬ УВАГУ, ЩО ВАШІ ВІДНОСИНИ ЗІ СТОРОННІМИ ПОСТАЧАЛЬНИКАМИ
              ПОСЛУГ, ПОВ'ЯЗАНИМИ З ВАШИМИ ОБЛІКОВИМИ ЗАПИСАМИ ТРЕТІХ СТОРІН,
              РЕГУЛЮЮТЬСЯ ВИКЛЮЧНО ВАШОЮ УГОДОЮ (УГОДАМИ) З ТАКИМИ СТОРОННІМИ
              ПОСТАЧАЛЬНИКАМИ ПОСЛУГ.** Ми не докладаємо жодних зусиль для
              перевірки будь-якого Контенту соціальної мережі на будь-які цілі,
              включаючи, але не обмежуючись, точність, законність або
              непорушення прав, і ми не несемо відповідальності за будь-який
              Контент соціальної мережі. Ви визнаєте та погоджуєтесь, що ми
              можемо отримувати доступ до вашої адресної книги електронної
              пошти, пов'язаної з Обліковим записом третьої сторони, та до
              вашого списку контактів, що зберігається на вашому мобільному
              пристрої або планшетному комп'ютері, виключно з метою
              ідентифікації та інформування вас про тих контактів, які також
              зареєструвалися для використання Послуг. Ви можете деактивувати
              зв'язок між Послугами та вашим Обліковим записом третьої сторони,
              зв'язавшись з нами за допомогою контактної інформації нижче або
              через налаштування вашого облікового запису (якщо застосовно). Ми
              намагатимемося видалити будь-яку інформацію, збережену на наших
              серверах, яка була отримана через такий Обліковий запис третьої
              сторони, за винятком імені користувача та зображення профілю, які
              стають пов'язаними з вашим обліковим записом.
            </p>
          </section>

          <section id="thirdparty">
            <h2 className="text-2xl font-semibold my-4">
              11. ВЕБ-САЙТИ ТА КОНТЕНТ ТРЕТІХ СТОРІН
            </h2>
            <p className="mb-6">
              Послуги можуть містити (або вам можуть надсилати через Сайт)
              посилання на інші веб-сайти ("Веб-сайти третіх сторін"), а також
              статті, фотографії, текст, графіку, зображення, дизайн, музику,
              звук, відео, інформацію, додатки, програмне забезпечення та інший
              контент або елементи, що належать або походять від третіх сторін
              ("Контент третіх сторін"). Такі Веб-сайти третіх сторін та Контент
              третіх сторін не розслідуються, не контролюються та не
              перевіряються нами на точність, доречність або повноту, і ми не
              несемо відповідальності за будь-які Веб-сайти третіх сторін, до
              яких доступ отримано через Послуги, або будь-який Контент третіх
              сторін, розміщений, доступний через або встановлений з Послуг,
              включаючи контент, точність, образливість, думки, надійність,
              практики конфіденційності або інші політики Веб-сайтів третіх
              сторін або Контенту третіх сторін. Включення, посилання або дозвіл
              на використання чи встановлення будь-яких Веб-сайтів третіх сторін
              або будь-якого Контенту третіх сторін не означає схвалення або
              підтвердження цього нами. Якщо ви вирішите залишити Послуги та
              отримати доступ до Веб-сайтів третіх сторін або використовувати чи
              встановлювати будь-який Контент третіх сторін, ви робите це на
              свій власний ризик, і ви повинні знати, що ці Юридичні умови
              більше не діють. Ви повинні переглянути відповідні умови та
              політики, включаючи практики конфіденційності та збору даних,
              будь-якого веб-сайту, на який ви переходите з Послуг, або що
              стосуються будь-яких додатків, які ви використовуєте або
              встановлюєте з Послуг. Будь-які покупки, які ви робите через
              Веб-сайти третіх сторін, здійснюватимуться через інші веб-сайти та
              від інших компаній, і ми не несемо жодної відповідальності щодо
              таких покупок, які є виключно між вами та відповідною третьою
              стороною. Ви погоджуєтесь і визнаєте, що ми не схвалюємо продукти
              чи послуги, запропоновані на Веб-сайтах третіх сторін, і ви
              звільняєте нас від будь-якої шкоди, спричиненої вашою покупкою
              таких продуктів чи послуг. Крім того, ви звільняєте нас від
              будь-яких збитків, завданих вам, або шкоди, заподіяної вам, що
              стосується або будь-яким чином випливає з будь-якого Контенту
              третіх сторін або будь-якого контакту з Веб-сайтами третіх сторін.
            </p>
          </section>

          <section id="advertisers">
            <h2 className="text-2xl font-semibold my-4">12. РЕКЛАМОДАВЦІ</h2>
            <p className="mb-6">
              Ми дозволяємо рекламодавцям відображати свої рекламні оголошення
              та іншу інформацію в певних областях Послуг, таких як бічні панелі
              або банерні оголошення (наприклад, через Google AdSense). Ми
              просто надаємо простір для розміщення таких рекламних оголошень, і
              ми не маємо інших відносин з рекламодавцями.
            </p>
          </section>

          <section id="management">
            <h2 className="text-2xl font-semibold my-4">
              13. УПРАВЛІННЯ ПОСЛУГАМИ
            </h2>
            <p className="mb-6">
              Ми залишаємо за собою право, але не зобов'язання: (1) здійснювати
              моніторинг Послуг на предмет порушень цих Юридичних умов; (2)
              вживати відповідних юридичних заходів проти будь-кого, хто, на наш
              власний розсуд, порушує закон або ці Юридичні умови, включаючи,
              без обмежень, повідомлення про такого користувача правоохоронним
              органам; (3) на наш власний розсуд і без обмежень, відмовляти,
              обмежувати доступ, обмежувати доступність або вимикати (наскільки
              це технічно можливо) будь-які ваші Внески або будь-яку їх частину;
              (4) на наш власний розсуд і без обмежень, повідомлення чи
              відповідальності, видаляти з Послуг або іншим чином вимикати всі
              файли та контент, які мають надмірний розмір або будь-яким чином
              обтяжують наші системи; та (5) іншим чином керувати Послугами
              таким чином, щоб захистити наші права та власність та сприяти
              належному функціонуванню Послуг.
            </p>
          </section>

          <section id="privacy">
            <h2 className="text-2xl font-semibold my-4">
              14. ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
            </h2>
            <p className="mb-6">
              Ми дбаємо про конфіденційність та безпеку даних. Будь ласка,
              перегляньте нашу Політику конфіденційності:{' '}
              <SeoLink
                href={privacyPolicyUrl}
                title="Політика конфіденційності"
                isTargetBlank
                className="text-blue-500 hover:underline"
              >
                {privacyPolicyUrl}
              </SeoLink>
              . Використовуючи Послуги, ви погоджуєтесь дотримуватися нашої
              Політики конфіденційності, яка включена до цих Юридичних умов.
              Зверніть увагу, що Послуги розміщуються в Сполучених Штатах. Якщо
              ви отримуєте доступ до Послуг з будь-якого іншого регіону світу із
              законами або іншими вимогами, що регулюють збір, використання або
              розкриття персональних даних, які відрізняються від чинних законів
              у Сполучених Штатах, то через ваше подальше використання Послуг ви
              передаєте свої дані до Сполучених Штатів, і ви явно погоджуєтесь
              на передачу та обробку ваших даних у Сполучених Штатах.
            </p>
          </section>

          <section id="terms">
            <h2 className="text-2xl font-semibold my-4">
              15. ТЕРМІН ДІЇ ТА ПРИПИНЕННЯ
            </h2>
            <p className="mb-4">
              Ці Юридичні умови залишаються в повній силі та дії під час
              використання вами Послуг. БЕЗ ОБМЕЖЕННЯ БУДЬ-ЯКОГО ІНШОГО
              ПОЛОЖЕННЯ ЦИХ ЮРИДИЧНИХ УМОВ, МИ ЗАЛИШАЄМО ЗА СОБОЮ ПРАВО, НА НАШ
              ВЛАСНИЙ РОЗСУД І БЕЗ ПОВІДОМЛЕННЯ АБО ВІДПОВІДАЛЬНОСТІ, ВІДМОВИТИ
              В ДОСТУПІ ДО ПОСЛУГ ТА ЇХ ВИКОРИСТАННІ (ВКЛЮЧАЮЧИ БЛОКУВАННЯ
              ПЕВНИХ IP-АДРЕС) БУДЬ-ЯКІЙ ОСОБІ З БУДЬ-ЯКОЇ ПРИЧИНИ АБО БЕЗ
              ПРИЧИНИ, ВКЛЮЧАЮЧИ, БЕЗ ОБМЕЖЕНЬ, ПОРУШЕННЯ БУДЬ-ЯКОГО ЗАЯВЛЕННЯ,
              ГАРАНТІЇ АБО УМОВИ, ЩО МІСТЯТЬСЯ В ЦИХ ЮРИДИЧНИХ УМОВАХ АБО
              БУДЬ-ЯКОМУ ЧИННОМУ ЗАКОНІ ЧИ НОРМАТИВНОМУ АКТІ. МИ МОЖЕМО
              ПРИПИНИТИ ВАШЕ ВИКОРИСТАННЯ АБО УЧАСТЬ У ПОСЛУГАХ АБО ВИДАЛИТИ ВАШ
              ОБЛІКОВИЙ ЗАПИС ТА БУДЬ-ЯКИЙ КОНТЕНТ АБО ІНФОРМАЦІЮ, ЯКІ ВИ
              РОЗМІСТИЛИ, У БУДЬ-ЯКИЙ ЧАС, БЕЗ ПОПЕРЕДЖЕННЯ, НА НАШ ВЛАСНИЙ
              РОЗСУД.
            </p>
            <p className="mb-6">
              Якщо ми припинимо або призупинимо дію вашого облікового запису з
              будь-якої причини, вам заборонено реєструвати та створювати новий
              обліковий запис під вашим ім'ям, вигаданим або позиченим ім'ям,
              або ім'ям будь-якої третьої сторони, навіть якщо ви можете діяти
              від імені третьої сторони. Крім припинення або призупинення дії
              вашого облікового запису, ми залишаємо за собою право вживати
              відповідних юридичних заходів, включаючи, без обмежень, цивільне,
              кримінальне та судове переслідування.
            </p>
          </section>

          <section id="modifications">
            <h2 className="text-2xl font-semibold my-4">
              16. ЗМІНИ ТА ПЕРЕРВИ
            </h2>
            <p className="mb-4">
              Ми залишаємо за собою право змінювати, модифікувати або видаляти
              вміст Послуг у будь-який час або з будь-якої причини на наш
              власний розсуд без попередження. Однак ми не зобов'язані
              оновлювати будь-яку інформацію на наших Послугах. Ми також
              залишаємо за собою право змінювати або припиняти всі або частину
              Послуг без попередження в будь-який час. Ми не несемо
              відповідальності перед вами або будь-якою третьою стороною за
              будь-які зміни, зміну ціни, призупинення або припинення Послуг.
            </p>
            <p className="mb-6">
              Ми не можемо гарантувати, що Послуги будуть доступні постійно. У
              нас можуть виникати проблеми з обладнанням, програмним
              забезпеченням або інші проблеми, або нам може знадобитися виконати
              технічне обслуговування, пов'язане з Послугами, що призведе до
              перерв, затримок або помилок. Ми залишаємо за собою право
              змінювати, переглядати, оновлювати, призупиняти, припиняти або
              іншим чином модифікувати Послуги в будь-який час або з будь-якої
              причини без попередження вас. Ви погоджуєтесь, що ми не несемо
              жодної відповідальності за будь-які збитки, шкоду або незручності,
              спричинені вашою неможливістю отримати доступ до Послуг або
              використовувати їх під час будь-якого простою або припинення
              Послуг. Ніщо в цих Юридичних умовах не буде тлумачитися як таке,
              що зобов'язує нас підтримувати Послуги або надавати будь-які
              виправлення, оновлення або випуски у зв'язку з ними.
            </p>
          </section>

          <section id="law">
            <h2 className="text-2xl font-semibold my-4">
              17. РЕГУЛЮЮЧЕ ЗАКОНОДАВСТВО
            </h2>
            <p className="mb-6">
              Ці Юридичні умови регулюються та тлумачаться відповідно до
              законодавства України. {siteLegalName || 'Ви'} та ми беззастережно
              погоджуємось, що суди України матимуть виключну юрисдикцію для
              вирішення будь-яких спорів, які можуть виникнути у зв'язку з цими
              Юридичними умовами.
            </p>
          </section>

          <section id="disputes">
            <h2 className="text-2xl font-semibold my-4">
              18. ВИРІШЕННЯ СПОРІВ
            </h2>
            <h3 className="text-xl font-semibold my-2">
              Неформальні переговори
            </h3>
            <p className="mb-4">
              Щоб прискорити вирішення та контролювати вартість будь-якого
              спору, розбіжності або претензії, пов'язаної з цими Юридичними
              умовами (кожен "Спір" і разом "Спори"), порушеної вами або нами
              (індивідуально "Сторона" і разом "Сторони"), Сторони погоджуються
              спочатку спробувати провести неформальні переговори щодо
              будь-якого Спору (за винятком тих Спорів, які прямо передбачені
              нижче) протягом щонайменше тридцяти (30) днів до початку
              арбітражу. Такі неформальні переговори розпочинаються після
              письмового повідомлення однієї Сторони іншій Стороні.
            </p>
            <h3 className="text-xl font-semibold my-2">
              Обов'язковий арбітраж
            </h3>
            <p className="mb-4">
              Будь-який спір, що виникає з або у зв'язку з цими Юридичними
              умовами, включаючи будь-яке питання щодо їх існування, дійсності
              або припинення, повинен бути переданий на розгляд та остаточно
              вирішений Міжнародним комерційним арбітражним судом при
              Торгово-промисловій палаті України (МКАС) відповідно до Регламенту
              МКАС, який вважається включеним шляхом посилання до цього пункту.
              Кількість арбітрів – один (1). Місцем або юридичним місцем
              арбітражу є Київ, Україна. Мова провадження – українська.
              Регулюючим правом цих Юридичних умов є матеріальне право України.
            </p>
            <h3 className="text-xl font-semibold my-2">Обмеження</h3>
            <p className="mb-4">
              Сторони погоджуються, що будь-який арбітраж обмежується Спором між
              Сторонами індивідуально. У повній мірі, дозволеній законом, (а)
              жоден арбітраж не повинен об'єднуватися з будь-яким іншим
              провадженням; (б) немає права або повноважень для арбітражного
              розгляду будь-якого Спору на основі колективного позову або
              використання процедур колективного позову; та (в) немає права або
              повноважень для порушення будь-якого Спору в передбачуваній
              представницькій якості від імені широкої громадськості або
              будь-яких інших осіб.
            </p>
            <h3 className="text-xl font-semibold my-2">
              Винятки з неформальних переговорів та арбітражу
            </h3>
            <p className="mb-6">
              Сторони погоджуються, що наступні Спори не підпадають під дію
              вищезазначених положень щодо неформальних переговорів та
              обов'язкового арбітражу: (а) будь-які Спори, що стосуються
              забезпечення або захисту, або стосуються дійсності будь-яких прав
              інтелектуальної власності Сторони; (б) будь-які Спори, пов'язані з
              або виникаючі з тверджень про крадіжку, піратство, вторгнення в
              приватне життя або несанкціоноване використання; та (в) будь-які
              претензії на судову заборону. Якщо це положення буде визнано
              незаконним або таким, що не має позовної сили, то жодна зі Сторін
              не обиратиме арбітражний розгляд будь-якого Спору, що підпадає під
              ту частину цього положення, яка визнана незаконною або такою, що
              не має позовної сили, і такий Спір буде вирішуватися судом
              компетентної юрисдикції в судах, перелічених для юрисдикції вище,
              і Сторони погоджуються підкорятися персональній юрисдикції цього
              суду.
            </p>
          </section>

          <section id="corrections">
            <h2 className="text-2xl font-semibold my-4">19. ВИПРАВЛЕННЯ</h2>
            <p className="mb-6">
              На Послугах може міститися інформація, яка містить друкарські
              помилки, неточності або упущення, включаючи описи, ціни,
              доступність та різну іншу інформацію. Ми залишаємо за собою право
              виправляти будь-які помилки, неточності або упущення та змінювати
              або оновлювати інформацію на Послугах у будь-який час без
              попереднього повідомлення.
            </p>
          </section>

          <section id="disclaimer">
            <h2 className="text-2xl font-semibold my-4">
              20. ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ
            </h2>
            <p className="mb-4">
              ПОСЛУГИ НАДАЮТЬСЯ НА УМОВАХ "ЯК Є" ТА "ЯК ДОСТУПНО". ВИ
              ПОГОДЖУЄТЕСЬ, ЩО ВИКОРИСТАННЯ ВАМИ ПОСЛУГ ВІДБУВАТИМЕТЬСЯ НА ВАШ
              ВЛАСНИЙ РИЗИК. У ПОВНІЙ МІРІ, ДОЗВОЛЕНІЙ ЗАКОНОМ, МИ ВІДМОВЛЯЄМОСЬ
              ВІД УСІХ ГАРАНТІЙ, ЯВНИХ АБО НЕЯВНИХ, У ЗВ'ЯЗКУ З ПОСЛУГАМИ ТА
              ВАШИМ ЇХ ВИКОРИСТАННЯМ, ВКЛЮЧАЮЧИ, БЕЗ ОБМЕЖЕНЬ, НЕЯВНІ ГАРАНТІЇ
              ПРИДАТНОСТІ ДЛЯ ПРОДАЖУ, ПРИДАТНОСТІ ДЛЯ КОНКРЕТНОЇ МЕТИ ТА
              НЕПОРУШЕННЯ ПРАВ. МИ НЕ ДАЄМО ЖОДНИХ ГАРАНТІЙ АБО ЗАЯВ ЩОДО
              ТОЧНОСТІ АБО ПОВНОТИ КОНТЕНТУ ПОСЛУГ АБО КОНТЕНТУ БУДЬ-ЯКИХ
              ВЕБ-САЙТІВ АБО МОБІЛЬНИХ ДОДАТКІВ, ПОВ'ЯЗАНИХ З ПОСЛУГАМИ, І МИ НЕ
              НЕСЕМО ЖОДНОЇ ВІДПОВІДАЛЬНОСТІ ЗА БУДЬ-ЯКІ (1) ПОМИЛКИ, ПОХИБКИ
              АБО НЕТОЧНОСТІ КОНТЕНТУ ТА МАТЕРІАЛІВ, (2) ТРАВМИ АБО МАЙНОВУ
              ШКОДУ БУДЬ-ЯКОГО ХАРАКТЕРУ, ЩО ВИНИКЛИ В РЕЗУЛЬТАТІ ВАШОГО ДОСТУПУ
              ДО ПОСЛУГ ТА ЇХ ВИКОРИСТАННЯ, (3) БУДЬ-ЯКИЙ НЕСАНКЦІОНОВАНИЙ
              ДОСТУП ДО АБО ВИКОРИСТАННЯ НАШИХ ЗАХИЩЕНИХ СЕРВЕРІВ ТА/АБО
              БУДЬ-ЯКОЇ ТА ВСІЄЇ ОСОБИСТОЇ ІНФОРМАЦІЇ ТА/АБО ФІНАНСОВОЇ
              ІНФОРМАЦІЇ, ЩО ЗБЕРІГАЄТЬСЯ НА НИХ, (4) БУДЬ-ЯКЕ ПЕРЕРИВАННЯ АБО
              ПРИПИНЕННЯ ПЕРЕДАЧІ ДО АБО З ПОСЛУГ, (5) БУДЬ-ЯКІ ЖУЧКИ, ВІРУСИ,
              ТРОЯНИ АБО ПОДІБНЕ, ЩО МОЖЕ БУТИ ПЕРЕДАНО ДО АБО ЧЕРЕЗ ПОСЛУГИ
              БУДЬ-ЯКОЮ ТРЕТЬОЮ СТОРОНОЮ, ТА/АБО (6) БУДЬ-ЯКІ ПОМИЛКИ АБО
              УПУЩЕННЯ В БУДЬ-ЯКОМУ КОНТЕНТІ ТА МАТЕРІАЛАХ АБО ЗА БУДЬ-ЯКІ
              ЗБИТКИ ЧИ ШКОДУ БУДЬ-ЯКОГО РОДУ, ЗАПОДІЯНІ В РЕЗУЛЬТАТІ
              ВИКОРИСТАННЯ БУДЬ-ЯКОГО КОНТЕНТУ, РОЗМІЩЕНОГО, ПЕРЕДАНОГО АБО
              ІНШИМ ЧИНОМ ЗРОБЛЕНОГО ДОСТУПНИМ ЧЕРЕЗ ПОСЛУГИ. МИ НЕ ГАРАНТУЄМО,
              НЕ ПІДТРИМУЄМО, НЕ ЗАБЕЗПЕЧУЄМО І НЕ НЕСЕМО ВІДПОВІДАЛЬНОСТІ ЗА
              БУДЬ-ЯКИЙ ПРОДУКТ АБО ПОСЛУГУ, РЕКЛАМОВАНІ АБО ЗАПРОПОНОВАНІ
              ТРЕТЬОЮ СТОРОНОЮ ЧЕРЕЗ ПОСЛУГИ, БУДЬ-ЯКИЙ ВЕБ-САЙТ З
              ГІПЕРПОСИЛАННЯМ АБО БУДЬ-ЯКИЙ ВЕБ-САЙТ ЧИ МОБІЛЬНИЙ ДОДАТОК,
              ПРЕДСТАВЛЕНИЙ У БУДЬ-ЯКОМУ БАНЕРІ АБО ІНШІЙ РЕКЛАМІ, І МИ НЕ
              БУДЕМО СТОРОНОЮ АБО БУДЬ-ЯКИМ ЧИНОМ НЕСТИ ВІДПОВІДАЛЬНІСТЬ ЗА
              МОНІТОРИНГ БУДЬ-ЯКИХ ТРАНЗАКЦІЙ МІЖ ВАМИ ТА БУДЬ-ЯКИМИ СТОРОННІМИ
              ПОСТАЧАЛЬНИКАМИ ПРОДУКТІВ АБО ПОСЛУГ. ЯК І ПРИ ПОКУПЦІ ПРОДУКТУ
              АБО ПОСЛУГИ ЧЕРЕЗ БУДЬ-ЯКЕ СЕРЕДОВИЩЕ АБО В БУДЬ-ЯКІЙ ОБСТАНОВЦІ,
              ВИ ПОВИННІ ВИКОРИСТОВУВАТИ СВОЄ НАЙКРАЩЕ СУДЖЕННЯ ТА ВИЯВЛЯТИ
              ОБЕРЕЖНІСТЬ, ДЕ ЦЕ ДОЦІЛЬНО.
            </p>

            <p className="mb-4">
              <strong>ВАЖЛИВІ ВІДМОВИ ВІД ВІДПОВІДАЛЬНОСТІ:</strong>
            </p>
            <p className="mb-4">
              ІНФОРМАЦІЯ, НАДАНА ЧЕРЕЗ НАШІ ПОСЛУГИ (ВКЛЮЧАЮЧИ, АЛЕ НЕ
              ОБМЕЖУЮЧИСЬ, НУМЕРОЛОГІЧНІ РОЗРАХУНКИ, СТАТТІ В БЛОЗІ, ТЕСТИ,
              ВІДПОВІДІ ЧАТ-БОТА ТА КОНСУЛЬТАЦІЙНІ СЕАНСИ ТАРО) НАДАЄТЬСЯ
              ВИКЛЮЧНО В ІНФОРМАЦІЙНИХ, ОСВІТНІХ ТА РОЗВАЖАЛЬНИХ ЦІЛЯХ.
            </p>
            <p className="mb-4">
              ПОСЛУГИ НЕ ПРИЗНАЧЕНІ ЯК ЗАМІНА ПРОФЕСІЙНОЇ КОНСУЛЬТАЦІЇ,
              ВКЛЮЧАЮЧИ, АЛЕ НЕ ОБМЕЖУЮЧИСЬ, (А) ПРОФЕСІЙНУ МЕДИЧНУ АБО
              ПСИХІАТРИЧНУ КОНСУЛЬТАЦІЮ, ДІАГНОСТИКУ АБО ЛІКУВАННЯ, АБО (Б)
              ПРОФЕСІЙНУ ФІНАНСОВУ АБО ІНВЕСТИЦІЙНУ КОНСУЛЬТАЦІЮ АБО
              КЕРІВНИЦТВО, АБО (В) ПРОФЕСІЙНУ ЮРИДИЧНУ КОНСУЛЬТАЦІЮ. НІКОЛИ НЕ
              НЕХТУЙТЕ ПРОФЕСІЙНОЮ МЕДИЧНОЮ КОНСУЛЬТАЦІЄЮ АБО ІНШОЮ ПРОФЕСІЙНОЮ
              КОНСУЛЬТАЦІЄЮ І НЕ ВІДКЛАДАЙТЕ ЗВЕРНЕННЯ ЗА НЕЮ.
            </p>
            <p className="mb-6">
              ВАШЕ ПОКЛАДАННЯ НА ІНФОРМАЦІЮ, НАДАНУ ПОСЛУГАМИ, ВІДБУВАЄТЬСЯ
              ВИКЛЮЧНО НА ВАШ ВЛАСНИЙ ВИБІР. БУДЬ-ЯКІ РІШЕННЯ, ЯКІ ВИ ПРИЙМАЄТЕ
              НА ОСНОВІ ПОВНІСТЮ АБО ЧАСТКОВО ІНФОРМАЦІЇ, НАДАНОЇ ПОСЛУГАМИ,
              БУДУТЬ ВАШОЮ ВИКЛЮЧНОЮ ТА ОСОБИСТОЮ ВІДПОВІДАЛЬНІСТЮ. МИ НЕ
              ГАРАНТУЄМО ТОЧНІСТЬ, НАДІЙНІСТЬ АБО РЕЗУЛЬТАТИ, ЯКІ МОЖУТЬ БУТИ
              ОТРИМАНІ ВІД ВИКОРИСТАННЯ ПОСЛУГ.
            </p>
          </section>

          <section id="liability">
            <h2 className="text-2xl font-semibold my-4">
              21. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ
            </h2>
            <p className="mb-6">
              ЗА ЖОДНИХ ОБСТАВИН МИ АБО НАШІ ДИРЕКТОРИ, СПІВРОБІТНИКИ ЧИ АГЕНТИ
              НЕ НЕСЕМО ВІДПОВІДАЛЬНОСТІ ПЕРЕД ВАМИ АБО БУДЬ-ЯКОЮ ТРЕТЬОЮ
              СТОРОНОЮ ЗА БУДЬ-ЯКІ ПРЯМІ, НЕПРЯМІ, ПОБІЧНІ, ЗРАЗКОВІ, ВИПАДКОВІ,
              СПЕЦІАЛЬНІ АБО ШТРАФНІ ЗБИТКИ, ВКЛЮЧАЮЧИ УПУЩЕНУ ВИГОДУ, ВТРАЧЕНИЙ
              ДОХІД, ВТРАТУ ДАНИХ АБО ІНШІ ЗБИТКИ, ЩО ВИНИКАЮТЬ ВНАСЛІДОК
              ВИКОРИСТАННЯ ВАМИ ПОСЛУГ, НАВІТЬ ЯКЩО НАС БУЛО ПОВІДОМЛЕНО ПРО
              МОЖЛИВІСТЬ ТАКИХ ЗБИТКІВ. НЕЗВАЖАЮЧИ НА БУДЬ-ЩО ПРОТИЛЕЖНЕ, ЩО
              МІСТИТЬСЯ В ЦЬОМУ ДОКУМЕНТІ, НАША ВІДПОВІДАЛЬНІСТЬ ПЕРЕД ВАМИ ЗА
              БУДЬ-ЯКОЮ ПРИЧИНОЮ ТА НЕЗАЛЕЖНО ВІД ФОРМИ ПОЗОВУ, ЗАВЖДИ БУДЕ
              ОБМЕЖЕНА СУМОЮ, СПЛАЧЕНОЮ, ЯКЩО ТАКА БУЛА, ВАМИ НАМ. ПЕВНІ ЗАКОНИ
              ШТАТІВ США ТА МІЖНАРОДНІ ЗАКОНИ НЕ ДОЗВОЛЯЮТЬ ОБМЕЖЕННЯ НЕЯВНИХ
              ГАРАНТІЙ АБО ВИКЛЮЧЕННЯ ЧИ ОБМЕЖЕННЯ ПЕВНИХ ЗБИТКІВ. ЯКЩО ЦІ
              ЗАКОНИ ЗАСТОСОВУЮТЬСЯ ДО ВАС, ДЕЯКІ АБО ВСІ ВИЩЕЗАЗНАЧЕНІ ВІДМОВИ
              АБО ОБМЕЖЕННЯ МОЖУТЬ НЕ ЗАСТОСОВУВАТИСЯ ДО ВАС, І ВИ МОЖЕТЕ МАТИ
              ДОДАТКОВІ ПРАВА.
            </p>
          </section>

          <section id="indemnification">
            <h2 className="text-2xl font-semibold my-4">
              22. ВІДШКОДУВАННЯ ЗБИТКІВ
            </h2>
            <p className="mb-6">
              Ви погоджуєтесь захищати, відшкодовувати збитки та звільняти нас,
              включаючи наші дочірні компанії, афілійованих осіб та всіх наших
              відповідних посадових осіб, агентів, партнерів та співробітників,
              від будь-яких збитків, шкоди, відповідальності, претензій або
              вимог, включаючи розумні гонорари та витрати адвокатів,
              пред'явлених будь-якою третьою стороною через або внаслідок: (1)
              використання Послуг; (2) порушення цих Юридичних умов; (3)
              будь-якого порушення ваших заяв та гарантій, викладених у цих
              Юридичних умовах; (4) порушення вами прав третьої сторони,
              включаючи, але не обмежуючись, права інтелектуальної власності;
              або (5) будь-якої явної шкідливої дії щодо будь-якого іншого
              користувача Послуг, з яким ви зв'язалися через Послуги. Незважаючи
              на вищезазначене, ми залишаємо за собою право, за ваш рахунок,
              взяти на себе виключний захист та контроль над будь-яким питанням,
              за яке ви зобов'язані відшкодувати нам збитки, і ви погоджуєтесь
              співпрацювати, за ваш рахунок, з нашим захистом таких претензій.
              Ми докладемо розумних зусиль, щоб повідомити вас про будь-яку таку
              претензію, дію або провадження, яке підпадає під це відшкодування,
              як тільки нам стане про це відомо.
            </p>
          </section>

          <section id="userdata">
            <h2 className="text-2xl font-semibold my-4">
              23. ДАНІ КОРИСТУВАЧА
            </h2>
            <p className="mb-6">
              Ми будемо зберігати певні дані, які ви передаєте до Послуг з метою
              управління ефективністю Послуг, а також дані, що стосуються вашого
              використання Послуг. Хоча ми виконуємо регулярне рутинне резервне
              копіювання даних, ви несете повну відповідальність за всі дані,
              які ви передаєте або які стосуються будь-якої діяльності, яку ви
              здійснили за допомогою Послуг. Ви погоджуєтесь, що ми не несемо
              жодної відповідальності перед вами за будь-яку втрату або
              пошкодження будь-яких таких даних, і ви цим відмовляєтесь від
              будь-якого права позову проти нас, що виникає внаслідок будь-якої
              такої втрати або пошкодження таких даних.
            </p>
          </section>

          <section id="electronic">
            <h2 className="text-2xl font-semibold my-4">
              24. ЕЛЕКТРОННІ КОМУНІКАЦІЇ, ТРАНЗАКЦІЇ ТА ПІДПИСИ
            </h2>
            <p className="mb-6">
              Відвідування Послуг, надсилання нам електронних листів та
              заповнення онлайн-форм становлять електронні комунікації. Ви
              погоджуєтесь отримувати електронні комунікації та погоджуєтесь, що
              всі угоди, повідомлення, розкриття та інші комунікації, які ми
              надаємо вам електронно, через електронну пошту та на Послугах,
              задовольняють будь-яку юридичну вимогу щодо того, щоб така
              комунікація була в письмовій формі. ВИ ЦИМ ПОГОДЖУЄТЕСЬ НА
              ВИКОРИСТАННЯ ЕЛЕКТРОННИХ ПІДПИСІВ, ДОГОВОРІВ, ЗАМОВЛЕНЬ ТА ІНШИХ
              ЗАПИСІВ, А ТАКОЖ НА ЕЛЕКТРОННУ ДОСТАВКУ ПОВІДОМЛЕНЬ, ПОЛІТИК ТА
              ЗАПИСІВ ПРО ТРАНЗАКЦІЇ, ІНІЦІЙОВАНІ АБО ЗАВЕРШЕНІ НАМИ АБО ЧЕРЕЗ
              ПОСЛУГИ. Ви цим відмовляєтесь від будь-яких прав або вимог за
              будь-якими законами, нормативними актами, правилами, постановами
              або іншими законами в будь-якій юрисдикції, які вимагають
              оригінального підпису або доставки чи зберігання не-електронних
              записів, або до платежів чи надання кредитів будь-якими іншими
              засобами, ніж електронні засоби.
            </p>
          </section>

          <section id="california">
            <h2 className="text-2xl font-semibold my-4">
              25. КОРИСТУВАЧІ ТА ЖИТЕЛІ КАЛІФОРНІЇ
            </h2>
            <p className="mb-6">
              Якщо будь-яка скарга до нас не буде вирішена задовільно, ви можете
              зв'язатися з Відділом допомоги споживачам Відділу споживчих послуг
              Департаменту у справах споживачів Каліфорнії письмово за адресою
              1625 North Market Blvd., Suite N 112, Sacramento, California 95834
              або за телефоном (800) 952-5210 або (916) 445-1254.
            </p>
          </section>

          <section id="misc">
            <h2 className="text-2xl font-semibold my-4">26. РІЗНЕ</h2>
            <p className="mb-4">
              Ці Юридичні умови та будь-які політики або правила роботи,
              розміщені нами на Послугах або щодо Послуг, становлять повну угоду
              та розуміння між вами та нами. Наша нездатність здійснити або
              забезпечити виконання будь-якого права чи положення цих Юридичних
              умов не означатиме відмову від такого права чи положення. Ці
              Юридичні умови діють у повній мірі, дозволеній законом. Ми можемо
              передати будь-які або всі наші права та обов'язки іншим особам у
              будь-який час. Ми не несемо відповідальності за будь-які збитки,
              шкоду, затримку або невиконання, спричинені будь-якою причиною
              поза нашим розумним контролем. Якщо будь-яке положення або частина
              положення цих Юридичних умов буде визнано незаконним, недійсним
              або таким, що не має позовної сили, таке положення або частина
              положення вважається відокремлюваним від цих Юридичних умов і не
              впливає на дійсність та позовну силу будь-яких інших положень. Між
              вами та нами не створюється жодних спільних підприємств,
              партнерства, трудових або агентських відносин в результаті цих
              Юридичних умов або використання Послуг. Ви погоджуєтесь, що ці
              Юридичні умови не будуть тлумачитися проти нас на підставі того,
              що ми їх склали. Ви цим відмовляєтесь від будь-яких захистів, які
              ви можете мати на основі електронної форми цих Юридичних умов та
              відсутності підписання сторонами для виконання цих Юридичних умов.
            </p>
          </section>

          <section id="contact">
            <h2 className="text-2xl font-semibold my-4">
              27. ЗВ'ЯЖІТЬСЯ З НАМИ
            </h2>
            <p className="mb-6">
              Щоб вирішити скаргу щодо Послуг або отримати додаткову інформацію
              щодо використання Послуг, будь ласка, зв'яжіться з нами за
              Електронною поштою:{' '}
              <SeoLink
                href={`mailto:${siteMail}`}
                className="text-blue-500 hover:underline"
                title={`Написати листа на ${siteMail}`}
              >
                {siteMail}
              </SeoLink>
            </p>
          </section>
        </>
      ) : (
        <>
          {/* --- ENGLISH VERSION (First 10 points) --- */}
          <Title>TERMS AND CONDITIONS</Title>
          <p className="text-sm text-muted-foreground mb-6">
            Last updated: {lastUpdatedDate[lang]}
          </p>

          <h2 className="text-xl font-semibold my-4">
            AGREEMENT TO OUR LEGAL TERMS
          </h2>

          <p className="mb-4">
            We are {siteLegalName} ("<strong>Company</strong>," "
            <strong>we</strong>," "<strong>us</strong>," "<strong>our</strong>")
            {IS_SITE_ADDRESS_SHOWED && `, a company registered in Ukraine at:`}
          </p>
          {IS_SITE_ADDRESS_SHOWED && (
            <SiteAddress
              siteLegalName={siteLegalName}
              siteAddress={siteAddress[lang]}
            />
          )}

          <p className="mb-4">
            We operate the website{' '}
            <SeoLink
              href={baseUrl}
              title={`Visit ${SITE_DOMAIN}`}
              isTargetBlank
              className="text-blue-500 hover:underline"
            >
              {baseUrl}
            </SeoLink>{' '}
            (the "<strong>Site</strong>"), as well as any other related products
            and services that refer or link to these legal terms (the "
            <strong>Legal Terms</strong>") (collectively, the "
            <strong>Services</strong>").
          </p>
          <p className="mb-4">
            An online platform dedicated to esoteric knowledge and
            self-discovery through disciplines like Human Design, numerology,
            Tarot, Astrology, Sacred Geometry, and Feng Shui. The site offers
            tools such as a numerology calculator, informative blog articles,
            tests, an AI chatbot for guidance, and plans to offer paid
            consultation sessions with experts.
          </p>
          <p className="mb-4">
            You can contact us by email at{' '}
            <SeoLink
              href={`mailto:${siteMail}`}
              className="text-blue-500 hover:underline"
              title={`Send email to ${siteMail}`}
            >
              {siteMail}
            </SeoLink>
            .
          </p>
          <p className="mb-4">
            These Legal Terms constitute a legally binding agreement made
            between you, whether personally or on behalf of an entity ("
            <strong>you</strong>"), and {siteLegalName || 'us'}, concerning your
            access to and use of the Services. You agree that by accessing the
            Services, you have read, understood, and agreed to be bound by all
            of these Legal Terms. **IF YOU DO NOT AGREE WITH ALL OF THESE LEGAL
            TERMS, THEN YOU ARE EXPRESSLY PROHIBITED FROM USING THE SERVICES AND
            YOU MUST DISCONTINUE USE IMMEDIATELY.**
          </p>
          <p className="mb-4">
            We will post any updates to these legal terms on the relevant pages
            of our website and update the "Last updated" date. For material
            changes, we may also provide notice through the website interface
            or, for registered users, via email notification to the email
            address associated with their account.
          </p>
          <p className="mb-4">
            The Services are intended for users who are at least 18 years old.
            Persons under the age of 18 are not permitted to use or register for
            the Services.
          </p>
          <p className="mb-6">
            We recommend that you print a copy of these Legal Terms for your
            records.
          </p>

          <h2 className="text-xl font-semibold my-4">TABLE OF CONTENTS</h2>
          <ul className="list-decimal list-inside space-y-1 mb-6">
            <li>
              <a href="#services" className="text-blue-500 hover:underline">
                OUR SERVICES
              </a>
            </li>
            <li>
              <a href="#ip" className="text-blue-500 hover:underline">
                INTELLECTUAL PROPERTY RIGHTS
              </a>
            </li>
            <li>
              <a href="#userrep" className="text-blue-500 hover:underline">
                USER REPRESENTATIONS
              </a>
            </li>
            <li>
              <a href="#userreg" className="text-blue-500 hover:underline">
                USER REGISTRATION
              </a>
            </li>
            <li>
              <a href="#purchase" className="text-blue-500 hover:underline">
                PURCHASES AND PAYMENT
              </a>
            </li>
            <li>
              <a href="#policy" className="text-blue-500 hover:underline">
                REFUND POLICY
              </a>
            </li>
            <li>
              <a href="#prohibited" className="text-blue-500 hover:underline">
                PROHIBITED ACTIVITIES
              </a>
            </li>
            <li>
              <a href="#ugc" className="text-blue-500 hover:underline">
                USER GENERATED CONTRIBUTIONS
              </a>
            </li>
            <li>
              <a href="#license" className="text-blue-500 hover:underline">
                CONTRIBUTION LICENSE
              </a>
            </li>
            <li>
              <a href="#social" className="text-blue-500 hover:underline">
                SOCIAL MEDIA
              </a>
            </li>
            <li>
              <a href="#thirdparty" className="text-blue-500 hover:underline">
                THIRD-PARTY WEBSITES AND CONTENT
              </a>
            </li>
            <li>
              <a href="#advertisers" className="text-blue-500 hover:underline">
                ADVERTISERS
              </a>
            </li>
            <li>
              <a href="#management" className="text-blue-500 hover:underline">
                SERVICES MANAGEMENT
              </a>
            </li>
            <li>
              <a href="#privacy" className="text-blue-500 hover:underline">
                PRIVACY POLICY
              </a>
            </li>
            <li>
              <a href="#terms" className="text-blue-500 hover:underline">
                TERM AND TERMINATION
              </a>
            </li>
            <li>
              <a
                href="#modifications"
                className="text-blue-500 hover:underline"
              >
                MODIFICATIONS AND INTERRUPTIONS
              </a>
            </li>
            <li>
              <a href="#law" className="text-blue-500 hover:underline">
                GOVERNING LAW
              </a>
            </li>
            <li>
              <a href="#disputes" className="text-blue-500 hover:underline">
                DISPUTE RESOLUTION
              </a>
            </li>
            <li>
              <a href="#corrections" className="text-blue-500 hover:underline">
                CORRECTIONS
              </a>
            </li>
            <li>
              <a href="#disclaimer" className="text-blue-500 hover:underline">
                DISCLAIMER
              </a>
            </li>
            <li>
              <a href="#liability" className="text-blue-500 hover:underline">
                LIMITATIONS OF LIABILITY
              </a>
            </li>
            <li>
              <a
                href="#indemnification"
                className="text-blue-500 hover:underline"
              >
                INDEMNIFICATION
              </a>
            </li>
            <li>
              <a href="#userdata" className="text-blue-500 hover:underline">
                USER DATA
              </a>
            </li>
            <li>
              <a href="#electronic" className="text-blue-500 hover:underline">
                ELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURES
              </a>
            </li>
            <li>
              <a href="#california" className="text-blue-500 hover:underline">
                CALIFORNIA USERS AND RESIDENTS
              </a>
            </li>
            <li>
              <a href="#misc" className="text-blue-500 hover:underline">
                MISCELLANEOUS
              </a>
            </li>
            <li>
              <a href="#contact" className="text-blue-500 hover:underline">
                CONTACT US
              </a>
            </li>
          </ul>

          <section id="services">
            <h2 className="text-2xl font-semibold my-4">1. OUR SERVICES</h2>
            <p className="mb-4">
              The information provided when using the Services is not intended
              for distribution to or use by any person or entity in any
              jurisdiction or country where such distribution or use would be
              contrary to law or regulation or which would subject us to any
              registration requirement within such jurisdiction or country.
              Accordingly, those persons who choose to access the Services from
              other locations do so on their own initiative and are solely
              responsible for compliance with local laws, if and to the extent
              local laws are applicable.
            </p>
            <p className="mb-4">
              The Services are not tailored to comply with industry-specific
              regulations (Health Insurance Portability and Accountability Act
              (HIPAA), Federal Information Security Management Act (FISMA),
              etc.), so if your interactions would be subjected to such laws,
              you may not use the Services. You may not use the Services in a
              way that would violate the Gramm-Leach-Bliley Act (GLBA).
            </p>
          </section>

          <section id="ip">
            <h2 className="text-2xl font-semibold my-4">
              2. INTELLECTUAL PROPERTY RIGHTS
            </h2>
            <h3 className="text-xl font-semibold my-2">
              Our intellectual property
            </h3>
            <p className="mb-4">
              We are the owner or the licensee of all intellectual property
              rights in our Services, including all source code, databases,
              functionality, software, website designs, audio, video, text,
              photographs, and graphics in the Services (collectively, the "
              <strong>Content</strong>"), as well as the trademarks, service
              marks, and logos contained therein (the "<strong>Marks</strong>").
            </p>
            <p className="mb-4">
              Our Content and Marks are protected by copyright and trademark
              laws (and various other intellectual property rights and unfair
              competition laws) and treaties in the United States and around the
              world.
            </p>
            <p className="mb-4">
              The Content and Marks are provided in or through the Services "AS
              IS" for your personal, non-commercial use only.
            </p>
            <h3 className="text-xl font-semibold my-2">
              Your use of our Services
            </h3>
            <p className="mb-4">
              Subject to your compliance with these Legal Terms, including the "
              <a href="#prohibited" className="text-blue-500 hover:underline">
                PROHIBITED ACTIVITIES
              </a>
              " section below, we grant you a non-exclusive, non-transferable,
              revocable license to:
            </p>
            <ul className="list-disc list-inside mb-4 pl-8">
              <li>access the Services; and</li>
              <li>
                download or print a copy of any portion of the Content to which
                you have properly gained access,
              </li>
            </ul>
            <p className="mb-4">
              solely for your personal, non-commercial use.
            </p>
            <p className="mb-4">
              Except as set out in this section or elsewhere in our Legal Terms,
              no part of the Services and no Content or Marks may be copied,
              reproduced, aggregated, republished, uploaded, posted, publicly
              displayed, encoded, translated, transmitted, distributed, sold,
              licensed, or otherwise exploited for any commercial purpose
              whatsoever, without our express prior written permission.
            </p>
            <p className="mb-4">
              If you wish to make any use of the Services, Content, or Marks
              other than as set out in this section or elsewhere in our Legal
              Terms, please address your request to:{' '}
              <SeoLink
                href={`mailto:${siteMail}`}
                className="text-blue-500 hover:underline"
                title={`Send email to ${siteMail}`}
              >
                {siteMail}
              </SeoLink>
              . If we ever grant you the permission to post, reproduce, or
              publicly display any part of our Services or Content, you must
              identify us as the owners or licensors of the Services, Content,
              or Marks and ensure that any copyright or proprietary notice
              appears or is visible on posting, reproducing, or displaying our
              Content.
            </p>
            <p className="mb-4">
              We reserve all rights not expressly granted to you in and to the
              Services, Content, and Marks.
            </p>
            <p className="mb-6">
              Any breach of these Intellectual Property Rights will constitute a
              material breach of our Legal Terms and your right to use our
              Services will terminate immediately.
            </p>
          </section>

          <section id="userrep">
            <h2 className="text-2xl font-semibold my-4">
              3. USER REPRESENTATIONS
            </h2>
            <p className="mb-4">
              By using the Services, you represent and warrant that: (1) all
              registration information you submit will be true, accurate,
              current, and complete; (2) you will maintain the accuracy of such
              information and promptly update such registration information as
              necessary; (3) you have the legal capacity and you agree to comply
              with these Legal Terms; (4) you are not under the age of 18; (5)
              you will not access the Services through automated or non-human
              means, whether through a bot, script or otherwise; (6) you will
              not use the Services for any illegal or unauthorized purpose; and
              (7) your use of the Services will not violate any applicable law
              or regulation.
            </p>
            <p className="mb-6">
              If you provide any information that is untrue, inaccurate, not
              current, or incomplete, we have the right to suspend or terminate
              your account and refuse any and all current or future use of the
              Services (or any portion thereof).
            </p>
          </section>

          <section id="userreg">
            <h2 className="text-2xl font-semibold my-4">
              4. USER REGISTRATION
            </h2>
            <p className="mb-4">
              You may be required to register to use the Services (specifically
              for accessing paid sessions). You agree to keep your password
              confidential and will be responsible for all use of your account
              and password.
            </p>
            <p className="mb-6">
              We reserve the right to remove, reclaim, or change a username you
              select if we determine, in our sole discretion, that such username
              is inappropriate, obscene, or otherwise objectionable.
            </p>
          </section>

          <section id="purchase">
            <h2 className="text-2xl font-semibold my-4">
              5. PURCHASES AND PAYMENT
            </h2>
            <p className="mb-4">We accept the following forms of payment:</p>
            <ul className="list-disc list-inside mb-4 pl-8">
              <li>Visa</li>
              <li>Mastercard</li>
              <li>American Express</li>
              {/* Add others if supported via Stripe */}
            </ul>
            <p className="mb-4">
              You agree to provide current, complete, and accurate purchase and
              account information for all purchases made via the Services. You
              further agree to promptly update account and payment information,
              including email address, payment method, and payment card
              expiration date, so that we can complete your transactions and
              contact you as needed. Sales tax (VAT) will be added to the price
              of purchases as deemed required by us. We may change prices at any
              time. All payments shall be in Euros (EUR).
            </p>
            <p className="mb-4">
              You agree to pay all charges at the prices then in effect for your
              purchases and any applicable shipping fees, and you authorize us
              to charge your chosen payment provider for any such amounts upon
              placing your order. We reserve the right to correct any errors or
              mistakes in pricing, even if we have already requested or received
              payment.
            </p>
            {/* Specifics for tokens */}
            <p className="mb-4">
              To access certain Services, such as paid Tarot sessions, you need
              to top up your internal credit balance (hereinafter "
              <strong>Tokens</strong>") in your account. You can top up your
              Token balance by purchasing Token packages at the prices indicated
              on the Site using the available payment methods via the Stripe
              payment system. The value of Tokens is set at 1 Euro per 100
              Tokens (or another value if changed). Upon your first
              registration/authorization, 300 bonus Tokens may be credited to
              your balance. Tokens are deducted from your balance when using the
              respective paid Services according to the rates specified on the
              Site (e.g., 500 Tokens per 5 minutes of a session).
            </p>
            <p className="mb-6">
              We reserve the right to refuse any order placed through the
              Services. We may, in our sole discretion, limit or cancel
              quantities purchased per person, per household, or per order.
              These restrictions may include orders placed by or under the same
              customer account, the same payment method, and/or orders that use
              the same billing or shipping address. We reserve the right to
              limit or prohibit orders that, in our sole judgment, appear to be
              placed by dealers, resellers, or distributors.
            </p>
          </section>

          <section id="policy">
            <h2 className="text-2xl font-semibold my-4">6. REFUND POLICY</h2>
            <p className="mb-6">
              All sales are final and no refund will be issued. This applies to
              both the purchase of Tokens and Tokens used to pay for Services.
            </p>
          </section>

          <section id="prohibited">
            <h2 className="text-2xl font-semibold my-4">
              7. PROHIBITED ACTIVITIES
            </h2>
            <p className="mb-4">
              You may not access or use the Services for any purpose other than
              that for which we make the Services available. The Services may
              not be used in connection with any commercial endeavors except
              those that are specifically endorsed or approved by us.
            </p>
            <p className="mb-4">As a user of the Services, you agree not to:</p>
            <ul className="list-disc list-inside mb-6 pl-8">
              <li>
                Systematically retrieve data or other content from the Services
                to create or compile, directly or indirectly, a collection,
                compilation, database, or directory without written permission
                from us.
              </li>
              <li>
                Trick, defraud, or mislead us and other users, especially in any
                attempt to learn sensitive account information such as user
                passwords.
              </li>
              <li>
                Circumvent, disable, or otherwise interfere with
                security-related features of the Services, including features
                that prevent or restrict the use or copying of any Content or
                enforce limitations on the use of the Services and/or the
                Content contained therein.
              </li>
              <li>
                Disparage, tarnish, or otherwise harm, in our opinion, us and/or
                the Services.
              </li>
              <li>
                Use any information obtained from the Services in order to
                harass, abuse, or harm another person.
              </li>
              <li>
                Make improper use of our support services or submit false
                reports of abuse or misconduct.
              </li>
              <li>
                Use the Services in a manner inconsistent with any applicable
                laws or regulations.
              </li>
              <li>
                Engage in unauthorized framing of or linking to the Services.
              </li>
              <li>
                Upload or transmit (or attempt to upload or to transmit)
                viruses, Trojan horses, or other material, including excessive
                use of capital letters and spamming (continuous posting of
                repetitive text), that interferes with any party’s uninterrupted
                use and enjoyment of the Services or modifies, impairs,
                disrupts, alters, or interferes with the use, features,
                functions, operation, or maintenance of the Services.
              </li>
              <li>
                Engage in any automated use of the system, such as using scripts
                to send comments or messages, or using any data mining, robots,
                or similar data gathering and extraction tools.
              </li>
              <li>
                Delete the copyright or other proprietary rights notice from any
                Content.
              </li>
              <li>
                Attempt to impersonate another user or person or use the
                username of another user.
              </li>
              <li>
                Upload or transmit (or attempt to upload or to transmit) any
                material that acts as a passive or active information collection
                or transmission mechanism, including without limitation, clear
                graphics interchange formats ("gifs"), 1x1 pixels, web bugs,
                cookies, or other similar devices (sometimes referred to as
                "spyware" or "passive collection mechanisms" or "pcms").
              </li>
              <li>
                Interfere with, disrupt, or create an undue burden on the
                Services or the networks or services connected to the Services.
              </li>
              <li>
                Harass, annoy, intimidate, or threaten any of our employees or
                agents engaged in providing any portion of the Services to you.
              </li>
              <li>
                Attempt to bypass any measures of the Services designed to
                prevent or restrict access to the Services, or any portion of
                the Services.
              </li>
              <li>
                Copy or adapt the Services' software, including but not limited
                to Flash, PHP, HTML, JavaScript, or other code.
              </li>
              <li>
                Except as permitted by applicable law, decipher, decompile,
                disassemble, or reverse engineer any of the software comprising
                or in any way making up a part of the Services.
              </li>
              <li>
                Except as may be the result of standard search engine or
                Internet browser usage, use, launch, develop, or distribute any
                automated system, including without limitation, any spider,
                robot, cheat utility, scraper, or offline reader that accesses
                the Services, or use or launch any unauthorized script or other
                software.
              </li>
              <li>
                Use a buying agent or purchasing agent to make purchases on the
                Services.
              </li>
              <li>
                Make any unauthorized use of the Services, including collecting
                usernames and/or email addresses of users by electronic or other
                means for the purpose of sending unsolicited email, or creating
                user accounts by automated means or under false pretenses.
              </li>
              <li>
                Use the Services as part of any effort to compete with us or
                otherwise use the Services and/or the Content for any
                revenue-generating endeavor or commercial enterprise.
              </li>
              <li>Sell or otherwise transfer your profile.</li>
            </ul>
          </section>

          {/* Sections 8 & 9 adapted based on UGC choice */}
          <section id="ugc">
            <h2 className="text-2xl font-semibold my-4">
              8. USER GENERATED CONTRIBUTIONS
            </h2>
            <p className="mb-4">
              The Services do not offer users to submit or post content. We do
              not provide you with the opportunity to create, submit, post,
              display, transmit, perform, publish, distribute, or broadcast
              content and materials to us or on the Services, including but not
              limited to text, writings, video, audio, photographs, graphics,
              comments, suggestions, or personal information or other material
              (collectively, "Contributions"). Contributions may be viewable by
              other users of the Services and through third-party websites. As
              such, any Contributions you transmit may be treated in accordance
              with the Services Privacy Policy. When you create or make
              available any Contributions, you thereby represent and warrant
              that:
            </p>
            {/* ... (List the representations from Termly if UGC is enabled, otherwise keep this simple) ... */}
            <p className="mb-6">
              Any use of the Services in violation of the foregoing violates
              these Legal Terms and may result in, among other things,
              termination or suspension of your rights to use the Services.
            </p>
          </section>

          <section id="license">
            <h2 className="text-2xl font-semibold my-4">
              9. CONTRIBUTION LICENSE
            </h2>
            <p className="mb-6">
              You and Services agree that we may access, store, process, and use
              any information and personal data that you provide following the
              terms of the Privacy Policy and your choices (including settings).
              By submitting suggestions or other feedback regarding the
              Services, you agree that we can use and share such feedback for
              any purpose without compensation to you. We do not assert any
              ownership over your Contributions. You retain full ownership of
              all of your Contributions and any intellectual property rights or
              other proprietary rights associated with your Contributions. We
              are not liable for any statements or representations in your
              Contributions provided by you in any area on the Services. You are
              solely responsible for your Contributions to the Services and you
              expressly agree to exonerate us from any and all responsibility
              and to refrain from any legal action against us regarding your
              Contributions.
            </p>
          </section>

          <section id="social">
            <h2 className="text-2xl font-semibold my-4">10. SOCIAL MEDIA</h2>
            <p className="mb-6">
              As part of the functionality of the Services, you may link your
              account with online accounts you have with third-party service
              providers (each such account, a "Third-Party Account") by either:
              (1) providing your Third-Party Account login information through
              the Services; or (2) allowing us to access your Third-Party
              Account, as is permitted under the applicable terms and conditions
              that govern your use of each Third-Party Account. You represent
              and warrant that you are entitled to disclose your Third-Party
              Account login information to us and/or grant us access to your
              Third-Party Account, without breach by you of any of the terms and
              conditions that govern your use of the applicable Third-Party
              Account, and without obligating us to pay any fees or making us
              subject to any usage limitations imposed by the third-party
              service provider of the Third-Party Account. By granting us access
              to any Third-Party Accounts, you understand that (1) we may
              access, make available, and store (if applicable) any content that
              you have provided to and stored in your Third-Party Account
              ("Social Network Content") so that it is available on and through
              the Services via your account, including without limitation any
              friend lists and (2) we may submit to and receive from your
              Third-Party Account additional information to the extent you are
              notified when you link your account with the Third-Party Account.
              Depending on the Third-Party Accounts you choose and subject to
              the privacy settings that you have set in such Third-Party
              Accounts, personally identifiable information that you post to
              your Third-Party Accounts may be available on and through your
              account on the Services. Please note that if a Third-Party Account
              or associated service becomes unavailable or our access to such
              Third-Party Account is terminated by the third-party service
              provider, then Social Network Content may no longer be available
              on and through the Services. You will have the ability to disable
              the connection between your account on the Services and your
              Third-Party Accounts at any time. **PLEASE NOTE THAT YOUR
              RELATIONSHIP WITH THE THIRD-PARTY SERVICE PROVIDERS ASSOCIATED
              WITH YOUR THIRD-PARTY ACCOUNTS IS GOVERNED SOLELY BY YOUR
              AGREEMENT(S) WITH SUCH THIRD-PARTY SERVICE PROVIDERS.** We make no
              effort to review any Social Network Content for any purpose,
              including but not limited to, for accuracy, legality, or
              non-infringement, and we are not responsible for any Social
              Network Content. You acknowledge and agree that we may access your
              email address book associated with a Third-Party Account and your
              contacts list stored on your mobile device or tablet computer
              solely for purposes of identifying and informing you of those
              contacts who have also registered to use the Services. You can
              deactivate the connection between the Services and your
              Third-Party Account by contacting us using the contact information
              below or through your account settings (if applicable). We will
              attempt to delete any information stored on our servers that was
              obtained through such Third-Party Account, except the username and
              profile picture that become associated with your account.
            </p>
          </section>

          <section id="thirdparty">
            <h2 className="text-2xl font-semibold my-4">
              11. THIRD-PARTY WEBSITES AND CONTENT
            </h2>
            <p className="mb-6">
              The Services may contain (or you may be sent via the Site) links
              to other websites ("Third-Party Websites") as well as articles,
              photographs, text, graphics, pictures, designs, music, sound,
              video, information, applications, software, and other content or
              items belonging to or originating from third parties ("Third-Party
              Content"). Such Third-Party Websites and Third-Party Content are
              not investigated, monitored, or checked for accuracy,
              appropriateness, or completeness by us, and we are not responsible
              for any Third-Party Websites accessed through the Services or any
              Third-Party Content posted on, available through, or installed
              from the Services, including the content, accuracy, offensiveness,
              opinions, reliability, privacy practices, or other policies of or
              contained in the Third-Party Websites or the Third-Party Content.
              Inclusion of, linking to, or permitting the use or installation of
              any Third-Party Websites or any Third-Party Content does not imply
              approval or endorsement thereof by us. If you decide to leave the
              Services and access the Third-Party Websites or to use or install
              any Third-Party Content, you do so at your own risk, and you
              should be aware these Legal Terms no longer govern. You should
              review the applicable terms and policies, including privacy and
              data gathering practices, of any website to which you navigate
              from the Services or relating to any applications you use or
              install from the Services. Any purchases you make through
              Third-Party Websites will be through other websites and from other
              companies, and we take no responsibility whatsoever in relation to
              such purchases which are exclusively between you and the
              applicable third party. You agree and acknowledge that we do not
              endorse the products or services offered on Third-Party Websites
              and you shall hold us harmless from any harm caused by your
              purchase of such products or services. Additionally, you shall
              hold us harmless from any losses sustained by you or harm caused
              to you relating to or resulting in any way from any Third-Party
              Content or any contact with Third-Party Websites.
            </p>
          </section>

          <section id="advertisers">
            <h2 className="text-2xl font-semibold my-4">12. ADVERTISERS</h2>
            <p className="mb-6">
              We allow advertisers to display their advertisements and other
              information in certain areas of the Services, such as sidebar
              advertisements or banner advertisements (e.g., via Google
              AdSense). We simply provide the space to place such
              advertisements, and we have no other relationship with
              advertisers.
            </p>
          </section>

          <section id="management">
            <h2 className="text-2xl font-semibold my-4">
              13. SERVICES MANAGEMENT
            </h2>
            <p className="mb-6">
              We reserve the right, but not the obligation, to: (1) monitor the
              Services for violations of these Legal Terms; (2) take appropriate
              legal action against anyone who, in our sole discretion, violates
              the law or these Legal Terms, including without limitation,
              reporting such user to law enforcement authorities; (3) in our
              sole discretion and without limitation, refuse, restrict access
              to, limit the availability of, or disable (to the extent
              technologically feasible) any of your Contributions or any portion
              thereof; (4) in our sole discretion and without limitation,
              notice, or liability, to remove from the Services or otherwise
              disable all files and content that are excessive in size or are in
              any way burdensome to our systems; and (5) otherwise manage the
              Services in a manner designed to protect our rights and property
              and to facilitate the proper functioning of the Services.
            </p>
          </section>

          <section id="privacy">
            <h2 className="text-2xl font-semibold my-4">14. PRIVACY POLICY</h2>
            <p className="mb-6">
              We care about data privacy and security. Please review our Privacy
              Policy:{' '}
              <SeoLink
                href={privacyPolicyUrl}
                title="Privacy Policy"
                isTargetBlank
                className="text-blue-500 hover:underline"
              >
                {privacyPolicyUrl}
              </SeoLink>
              . By using the Services, you agree to be bound by our Privacy
              Policy, which is incorporated into these Legal Terms. Please be
              advised the Services are hosted in the United States. If you
              access the Services from any other region of the world with laws
              or other requirements governing personal data collection, use, or
              disclosure that differ from applicable laws in the United States,
              then through your continued use of the Services, you are
              transferring your data to the United States, and you expressly
              consent to have your data transferred to and processed in the
              United States.
            </p>
          </section>

          <section id="terms">
            <h2 className="text-2xl font-semibold my-4">
              15. TERM AND TERMINATION
            </h2>
            <p className="mb-4">
              These Legal Terms shall remain in full force and effect while you
              use the Services. WITHOUT LIMITING ANY OTHER PROVISION OF THESE
              LEGAL TERMS, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND
              WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO AND USE OF THE
              SERVICES (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON
              FOR ANY REASON OR FOR NO REASON, INCLUDING WITHOUT LIMITATION FOR
              BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN
              THESE LEGAL TERMS OR OF ANY APPLICABLE LAW OR REGULATION. WE MAY
              TERMINATE YOUR USE OR PARTICIPATION IN THE SERVICES OR DELETE YOUR
              ACCOUNT AND ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY
              TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.
            </p>
            <p className="mb-6">
              If we terminate or suspend your account for any reason, you are
              prohibited from registering and creating a new account under your
              name, a fake or borrowed name, or the name of any third party,
              even if you may be acting on behalf of the third party. In
              addition to terminating or suspending your account, we reserve the
              right to take appropriate legal action, including without
              limitation pursuing civil, criminal, and injunctive redress.
            </p>
          </section>

          <section id="modifications">
            <h2 className="text-2xl font-semibold my-4">
              16. MODIFICATIONS AND INTERRUPTIONS
            </h2>
            <p className="mb-4">
              We reserve the right to change, modify, or remove the contents of
              the Services at any time or for any reason at our sole discretion
              without notice. However, we have no obligation to update any
              information on our Services. We also reserve the right to modify
              or discontinue all or part of the Services without notice at any
              time. We will not be liable to you or any third party for any
              modification, price change, suspension, or discontinuance of the
              Services.
            </p>
            <p className="mb-6">
              We cannot guarantee the Services will be available at all times.
              We may experience hardware, software, or other problems or need to
              perform maintenance related to the Services, resulting in
              interruptions, delays, or errors. We reserve the right to change,
              revise, update, suspend, discontinue, or otherwise modify the
              Services at any time or for any reason without notice to you. You
              agree that we have no liability whatsoever for any loss, damage,
              or inconvenience caused by your inability to access or use the
              Services during any downtime or discontinuance of the Services.
              Nothing in these Legal Terms will be construed to obligate us to
              maintain and support the Services or to supply any corrections,
              updates, or releases in connection therewith.
            </p>
          </section>

          <section id="law">
            <h2 className="text-2xl font-semibold my-4">17. GOVERNING LAW</h2>
            <p className="mb-6">
              These Legal Terms shall be governed by and defined following the
              laws of Ukraine. {siteLegalName || 'You'} and we irrevocably
              consent that the courts of Ukraine shall have exclusive
              jurisdiction to resolve any dispute which may arise in connection
              with these Legal Terms.
            </p>
          </section>

          <section id="disputes">
            <h2 className="text-2xl font-semibold my-4">
              18. DISPUTE RESOLUTION
            </h2>
            <h3 className="text-xl font-semibold my-2">
              Informal Negotiations
            </h3>
            <p className="mb-4">
              To expedite resolution and control the cost of any dispute,
              controversy, or claim related to these Legal Terms (each a "
              <strong>Dispute</strong>" and collectively, the "
              <strong>Disputes</strong>") brought by either you or us
              (individually, a "<strong>Party</strong>" and collectively, the "
              <strong>Parties</strong>"), the Parties agree to first attempt to
              negotiate any Dispute (except those Disputes expressly provided
              below) informally for at least thirty (30) days before initiating
              arbitration. Such informal negotiations commence upon written
              notice from one Party to the other Party.
            </p>
            <h3 className="text-xl font-semibold my-2">Binding Arbitration</h3>
            <p className="mb-4">
              Any dispute arising out of or in connection with these Legal
              Terms, including any question regarding its existence, validity,
              or termination, shall be referred to and finally resolved by the
              International Commercial Arbitration Court at the Ukrainian
              Chamber of Commerce and Industry (ICAC) in accordance with the
              Rules of the ICAC, which Rules are deemed to be incorporated by
              reference into this clause. The number of arbitrators shall be one
              (1). The seat, or legal place, or arbitration shall be Kyiv,
              Ukraine. The language of the proceedings shall be Ukrainian. The
              governing law of the Legal Terms shall be the substantive law of
              Ukraine.
            </p>
            <h3 className="text-xl font-semibold my-2">Restrictions</h3>
            <p className="mb-4">
              The Parties agree that any arbitration shall be limited to the
              Dispute between the Parties individually. To the full extent
              permitted by law, (a) no arbitration shall be joined with any
              other proceeding; (b) there is no right or authority for any
              Dispute to be arbitrated on a class-action basis or to utilize
              class action procedures; and (c) there is no right or authority
              for any Dispute to be brought in a purported representative
              capacity on behalf of the general public or any other persons.
            </p>
            <h3 className="text-xl font-semibold my-2">
              Exceptions to Informal Negotiations and Arbitration
            </h3>
            <p className="mb-6">
              The Parties agree that the following Disputes are not subject to
              the above provisions concerning informal negotiations binding
              arbitration: (a) any Disputes seeking to enforce or protect, or
              concerning the validity of, any of the intellectual property
              rights of a Party; (b) any Dispute related to, or arising from,
              allegations of theft, piracy, invasion of privacy, or unauthorized
              use; and (c) any claim for injunctive relief. If this provision is
              found to be illegal or unenforceable, then neither Party will
              elect to arbitrate any Dispute falling within that portion of this
              provision found to be illegal or unenforceable and such Dispute
              shall be decided by a court of competent jurisdiction within the
              courts listed for jurisdiction above, and the Parties agree to
              submit to the personal jurisdiction of that court.
            </p>
          </section>

          <section id="corrections">
            <h2 className="text-2xl font-semibold my-4">19. CORRECTIONS</h2>
            <p className="mb-6">
              There may be information on the Services that contains
              typographical errors, inaccuracies, or omissions, including
              descriptions, pricing, availability, and various other
              information. We reserve the right to correct any errors,
              inaccuracies, or omissions and to change or update the information
              on the Services at any time, without prior notice.
            </p>
          </section>

          <section id="disclaimer">
            <h2 className="text-2xl font-semibold my-4">20. DISCLAIMER</h2>
            <p className="mb-4">
              THE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU
              AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR SOLE RISK. TO
              THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES,
              EXPRESS OR IMPLIED, IN CONNECTION WITH THE SERVICES AND YOUR USE
              THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
              MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND
              NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT
              THE ACCURACY OR COMPLETENESS OF THE SERVICES' CONTENT OR THE
              CONTENT OF ANY WEBSITES OR MOBILE APPLICATIONS LINKED TO THE
              SERVICES AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY
              (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS,
              (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER,
              RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY
              UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND
              ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED
              THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR
              FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE
              LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY
              THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND
              MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A
              RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE
              MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE,
              GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE
              ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY
              HYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED
              IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT BE A PARTY TO
              OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION
              BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES.
              AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR
              IN ANY ENVIRONMENT, YOU SHOULD USE YOUR BEST JUDGMENT AND EXERCISE
              CAUTION WHERE APPROPRIATE.
            </p>
            {/* Important disclaimer for esoteric services */}
            <p className="mb-4">
              <strong>IMPORTANT DISCLAIMERS:</strong>
            </p>
            <p className="mb-4">
              THE INFORMATION PROVIDED THROUGH OUR SERVICES (INCLUDING, BUT NOT
              LIMITED TO, NUMEROLOGY CALCULATIONS, BLOG ARTICLES, TESTS, CHATBOT
              RESPONSES, AND TAROT READING SESSIONS) IS PROVIDED FOR
              INFORMATIONAL, EDUCATIONAL, AND ENTERTAINMENT PURPOSES ONLY.
            </p>
            <p className="mb-4">
              THE SERVICES ARE NOT INTENDED TO BE A SUBSTITUTE FOR PROFESSIONAL
              ADVICE, INCLUDING BUT NOT LIMITED TO (A) PROFESSIONAL MEDICAL OR
              PSYCHIATRIC ADVICE, DIAGNOSIS, OR TREATMENT, OR (B) PROFESSIONAL
              FINANCIAL OR INVESTMENT ADVICE OR GUIDANCE, OR (C) PROFESSIONAL
              LEGAL ADVICE. NEVER DISREGARD OR DELAY SEEKING PROFESSIONAL
              MEDICAL ADVICE OR OTHER PROFESSIONAL ADVICE.
            </p>
            <p className="mb-6">
              YOUR RELIANCE ON THE INFORMATION PROVIDED BY THE SERVICES IS
              SOLELY AT YOUR OWN ELECTION OR CHOICE. ANY AND ALL DECISIONS THAT
              YOU MAKE THAT ARE BASED IN WHOLE OR IN PART UPON INFORMATION
              PROVIDED BY THE SERVICES WILL BE YOUR SOLE AND EXCLUSIVE
              RESPONSIBILITY. WE DO NOT GUARANTEE THE ACCURACY, RELIABILITY, OR
              RESULTS THAT MAY BE OBTAINED FROM THE USE OF THE SERVICES.
            </p>
          </section>

          <section id="liability">
            <h2 className="text-2xl font-semibold my-4">
              21. LIMITATIONS OF LIABILITY
            </h2>
            <p className="mb-6">
              IN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE
              LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT,
              CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE
              DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA, OR
              OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE
              HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
              NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR
              LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE
              FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT
              PAID, IF ANY, BY YOU TO US. CERTAIN US STATE LAWS AND
              INTERNATIONAL LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES
              OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS
              APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS OR LIMITATIONS
              MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS.
            </p>
          </section>

          <section id="indemnification">
            <h2 className="text-2xl font-semibold my-4">22. INDEMNIFICATION</h2>
            <p className="mb-6">
              You agree to defend, indemnify, and hold us harmless, including
              our subsidiaries, affiliates, and all of our respective officers,
              agents, partners, and employees, from and against any loss,
              damage, liability, claim, or demand, including reasonable
              attorneys’ fees and expenses, made by any third party due to or
              arising out of: (1) use of the Services; (2) breach of these Legal
              Terms; (3) any breach of your representations and warranties set
              forth in these Legal Terms; (4) your violation of the rights of a
              third party, including but not limited to intellectual property
              rights; or (5) any overt harmful act toward any other user of the
              Services with whom you connected via the Services. Notwithstanding
              the foregoing, we reserve the right, at your expense, to assume
              the exclusive defense and control of any matter for which you are
              required to indemnify us, and you agree to cooperate, at your
              expense, with our defense of such claims. We will use reasonable
              efforts to notify you of any such claim, action, or proceeding
              which is subject to this indemnification upon becoming aware of
              it.
            </p>
          </section>

          <section id="userdata">
            <h2 className="text-2xl font-semibold my-4">23. USER DATA</h2>
            <p className="mb-6">
              We will maintain certain data that you transmit to the Services
              for the purpose of managing the performance of the Services, as
              well as data relating to your use of the Services. Although we
              perform regular routine backups of data, you are solely
              responsible for all data that you transmit or that relates to any
              activity you have undertaken using the Services. You agree that we
              shall have no liability to you for any loss or corruption of any
              such data, and you hereby waive any right of action against us
              arising from any such loss or corruption of such data.
            </p>
          </section>

          <section id="electronic">
            <h2 className="text-2xl font-semibold my-4">
              24. ELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURES
            </h2>
            <p className="mb-6">
              Visiting the Services, sending us emails, and completing online
              forms constitute electronic communications. You consent to receive
              electronic communications, and you agree that all agreements,
              notices, disclosures, and other communications we provide to you
              electronically, via email and on the Services, satisfy any legal
              requirement that such communication be in writing. YOU HEREBY
              AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND
              OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES,
              AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA
              THE SERVICES. You hereby waive any rights or requirements under
              any statutes, regulations, rules, ordinances, or other laws in any
              jurisdiction which require an original signature or delivery or
              retention of non-electronic records, or to payments or the
              granting of credits by any means other than electronic means.
            </p>
          </section>

          <section id="california">
            <h2 className="text-2xl font-semibold my-4">
              25. CALIFORNIA USERS AND RESIDENTS
            </h2>
            <p className="mb-6">
              If any complaint with us is not satisfactorily resolved, you can
              contact the Complaint Assistance Unit of the Division of Consumer
              Services of the California Department of Consumer Affairs in
              writing at 1625 North Market Blvd., Suite N 112, Sacramento,
              California 95834 or by telephone at (800) 952-5210 or (916)
              445-1254.
            </p>
          </section>

          <section id="misc">
            <h2 className="text-2xl font-semibold my-4">26. MISCELLANEOUS</h2>
            <p className="mb-4">
              These Legal Terms and any policies or operating rules posted by us
              on the Services or in respect to the Services constitute the
              entire agreement and understanding between you and us. Our failure
              to exercise or enforce any right or provision of these Legal Terms
              shall not operate as a waiver of such right or provision. These
              Legal Terms operate to the fullest extent permissible by law. We
              may assign any or all of our rights and obligations to others at
              any time. We shall not be responsible or liable for any loss,
              damage, delay, or failure to act caused by any cause beyond our
              reasonable control. If any provision or part of a provision of
              these Legal Terms is determined to be unlawful, void, or
              unenforceable, that provision or part of the provision is deemed
              severable from these Legal Terms and does not affect the validity
              and enforceability of any remaining provisions. There is no joint
              venture, partnership, employment or agency relationship created
              between you and us as a result of these Legal Terms or use of the
              Services. You agree that these Legal Terms will not be construed
              against us by virtue of having drafted them. You hereby waive any
              and all defenses you may have based on the electronic form of
              these Legal Terms and the lack of signing by the parties hereto to
              execute these Legal Terms.
            </p>
          </section>

          <section id="contact">
            <h2 className="text-2xl font-semibold my-4">27. CONTACT US</h2>
            <p className="mb-6">
              In order to resolve a complaint regarding the Services or to
              receive further information regarding use of the Services, please
              contact us at Email:{' '}
              <SeoLink
                href={`mailto:${siteMail}`}
                className="text-blue-500 hover:underline"
                title={`Send email to ${siteMail}`}
              >
                {siteMail}
              </SeoLink>
            </p>
          </section>
        </>
      )}
    </article>
  );
}
